zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_lp.c
/***************************************************************************//**
* \file cy_capsense_selftest_lp.c
* \version 10.0.0
*
* \brief
* This file provides the source code to the Built-in Self-test (BIST)
* functions.
*
********************************************************************************
* \copyright
* (c) 2021-2026, Infineon Technologies AG, or an affiliate of Infineon
* Technologies AG. All rights reserved.
* This software, associated documentation and materials ("Software") is
* owned by Infineon Technologies AG or one of its affiliates ("Infineon")
* and is protected by and subject to worldwide patent protection, worldwide
* copyright laws, and international treaty provisions. Therefore, you may use
* this Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software. If no license
* agreement applies, then any use, reproduction, modification, translation, or
* compilation of this Software is prohibited without the express written
* permission of Infineon.
*
* Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
* IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
* THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
* SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
* Infineon reserves the right to make changes to the Software without notice.
* You are responsible for properly designing, programming, and testing the
* functionality and safety of your intended application of the Software, as
* well as complying with any legal requirements related to its use. Infineon
* does not guarantee that the Software will be free from intrusion, data theft
* or loss, or other breaches ("Security Breaches"), and Infineon shall have
* no liability arising out of any Security Breaches. Unless otherwise
* explicitly approved by Infineon, the Software may not be used in any
* application where a failure of the Product or any consequences of the use
* thereof can reasonably be expected to result in personal injury.
*******************************************************************************/

#include <stddef.h>
#include <string.h>
#include "cy_syslib.h"
#include "cy_sysclk.h"
#include "cycfg_capsense_defines.h"
#include "cycfg_peripherals.h"
#include "cy_capsense_common.h"
#include "cy_capsense_sensing.h"
#include "cy_capsense_sensing_lp.h"
#include "cy_capsense_generator_lp.h"
#include "cy_capsense_selftest_lp.h"
#include "cy_capsense_sm_base_full_wave_lp.h"
#include "cy_gpio.h"

#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
    #include "cy_msclp.h"
#endif

#if (defined(CY_IP_M0S8MSCV3LP))

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN)

/*******************************************************************************
* Common local definitions for self-test
*******************************************************************************/

/* Port Data Register macros for BIST */
#define CY_CAPSENSE_BIST_DR_PIN2GND                             (0u)
#define CY_CAPSENSE_BIST_DR_PIN2VDD                             (1u)
/* Electrode capacitance measurement macros for BIST */
#define CY_CAPSENSE_BIST_CAP_SLOT_SCAN                          (0u)
#define CY_CAPSENSE_BIST_CAP_ELTD_SCAN                          (1u)
#define CY_CAPSENSE_BIST_CAP_SHIELD_SCAN                        (2u)
/** The number of BIST sense mode configurations for capacitance measurements (CSD + CSX) */
#define CY_CAPSENSE_BIST_SENSE_MODE_CONFIG_NUMBER               (2u)
#define CY_CAPSENSE_BIST_ELTD_CAP_MODCLK_DIV_DEFAULT            (1u)
#define CY_CAPSENSE_BIST_ELTD_CAP_MAX_MODCLK                    (48000000u)
#define CY_CAPSENSE_BIST_ELTD_CAP_SNSCLK_DIV_DEFAULT            (512u)
#define CY_CAPSENSE_BIST_SHIELD_CAP_SNSCLK_DIV_DEFAULT          (1024u)
#define CY_CAPSENSE_BIST_SNS_CLK_MIN_DIVIDER                    (4u)
#define CY_CAPSENSE_BIST_SNS_CLK_MAX_DIVIDER                    (4096u)
#define CY_CAPSENSE_BIST_ELTD_CAP_SUBCONV_NUM_DEFAULT           (100u)
#define CY_CAPSENSE_BIST_SHIELD_CAP_REF_CDAC_DEFAULT            (200u)
#define CY_CAPSENSE_BIST_ELTD_CAP_REF_CDAC_DEFAULT              (100u)
#define CY_CAPSENSE_BIST_MUTUAL_CAP_REF_CDAC_DEFAULT            (50u)
#define CY_CAPSENSE_BIST_WATCHDOG_MARGIN_COEFF                  (3u)
#define CY_CAPSENSE_BIST_CAP_MEAS_WDT_CYCLES_PER_LOOP           (5u)
#define CY_CAPSENSE_BIST_V3_ELTD_CAP_CYCLES_NUM                 (1u)
#define CY_CAPSENSE_BIST_CAP_MEAS_CDAC_LSB_FF_DIV_1000          (8870u)
#define CY_CAPSENSE_BIST_CP_MAX_VALUE                           (275000u)
#define CY_CAPSENSE_BIST_CSH_MAX_VALUE                          (1160000u)
#define CY_CAPSENSE_BIST_PROMILLE_FACTOR                        (1000u)
#define CY_CAPSENSE_BIST_ELTD_CAP_NUM_EPI_CYCLES                (2u)

/*******************************************************************************
* Macros for the external capacitor capacitance measurement test
*******************************************************************************/

#define CY_CAPSENSE_BIST_EXT_CAP_REF_CDAC_DEFAULT                               (250u)
#define CY_CAPSENSE_BIST_EXT_CAP_NUM_SUB_DEFAULT                                (8u)
#define CY_CAPSENSE_BIST_EXT_CAP_IMO_CLK_MHZ                                    (12u)
#define CY_CAPSENSE_BIST_EXT_CAP_WDT_FACTOR                                     (5u)
#define CY_CAPSENSE_BIST_EXT_CAP_ACCURACY_FACTOR                                (1150u)
#define CY_CAPSENSE_BIST_EXT_CAP_DISCHARGE_FACTOR                               (2u)
#define CY_CAPSENSE_BIST_EXT_CAP_RESULT_FACTOR                                  ((123uL * CY_CAPSENSE_REF_CDAC_LSB_X100 *\
                                                                                  CY_CAPSENSE_BIST_EXT_CAP_REF_CDAC_DEFAULT) /\
                                                                                  CY_CAPSENSE_CONVERSION_KILO)
#define CY_CAPSENSE_BIST_EXT_CAP_RESULT_DIVIDER                                 (CY_CAPSENSE_CONVERSION_HECTO *\
                                                                                 CY_CAPSENSE_CONVERSION_HECTO)
#define CY_CAPSENSE_BIST_EXT_CAP_MAX_CAP                                        (25u)
#define CY_CAPSENSE_BIST_EXT_CAP_CMOD_MAX_VALUE                                 (5u)

