zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_lp.c
/*******************************************************************************
* Macros for the BIST VDDA measurement test
*******************************************************************************/

#define CY_CAPSENSE_BIST_VDDA_MEAS_CMOD1_MAX_POSSIBLE_VALUE                     (20u)
#define CY_CAPSENSE_BIST_VDDA_MEAS_CMOD1_DISCHARGE_TIME                         ((CY_CAPSENSE_BIST_EXT_CAP_DISCHARGE_FACTOR *\
                                                                                  CY_CAPSENSE_BIST_VDDA_MEAS_CMOD1_MAX_POSSIBLE_VALUE *\
                                                                                  CY_CAPSENSE_BIST_EXT_CAP_SERIAL_RESISTANCE) /\
                                                                                 CY_CAPSENSE_CONVERSION_KILO)
#define CY_CAPSENSE_BIST_VDDA_MEAS_MAX_RAW                                      (((((CY_CAPSENSE_BIST_EXT_CAP_ACCURACY_FACTOR *\
                                                                                     CY_CAPSENSE_BIST_VDDA_MEAS_CMOD1_MAX_POSSIBLE_VALUE) *\
                                                                                    CY_CAPSENSE_CONVERSION_KILO) /\
                                                                                   CY_CAPSENSE_BIST_EXT_CAP_REF_CDAC_DEFAULT) *\
                                                                                  CY_CAPSENSE_CONVERSION_KILO) /\
                                                                                 CY_CAPSENSE_BIST_CAP_MEAS_CDAC_LSB_FF_DIV_1000)
#define CY_CAPSENSE_BIST_VDDA_MEAS_NUM_SNS_CLK                                  ((CY_CAPSENSE_BIST_VDDA_MEAS_MAX_RAW /\
                                                                                 (MSCLP_SNS_SNS_CTL_SENSE_DIV_Msk >>\
                                                                                  MSCLP_SNS_SNS_CTL_SENSE_DIV_Pos)) + 1u)
#define CY_CAPSENSE_BIST_VDDA_MEAS_BGREF_VALUE                                  (1200u)
#define CY_CAPSENSE_BIST_VDDA_MEAS_RESULT_FACTOR                                (1715u)
#define CY_CAPSENSE_BIST_VDDA_MEAS_RESULT_SHIFT                                 (710u)

/*******************************************************************************
* Function Prototypes
*******************************************************************************/

/******************************************************************************/
/** \cond SECTION_CAPSENSE_INTERNAL */
/** \addtogroup group_capsense_internal *//** \{ */
/******************************************************************************/

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN)
    static cy_en_capsense_bist_status_t Cy_CapSense_CheckAllWidgetCRC(
                cy_stc_capsense_context_t * context);
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN)) */

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_SHORT_EN)
    static cy_en_capsense_bist_status_t Cy_CapSense_SnsShortCheckSensor(
                    uint32_t widgetId,
                    uint32_t sensorId,
                    uint32_t mode,
                    cy_stc_capsense_context_t * context);
    static cy_en_capsense_bist_status_t Cy_CapSense_SnsShortCheckElectrode(
                    uint32_t widgetId,
                    uint32_t ioSnsId,
                    uint32_t mode,
                    const cy_stc_capsense_context_t * context);
    static void Cy_CapSense_SnsShortUpdateTestResult(
                    uint32_t widgetId,
                    uint32_t sensorId,
                    cy_stc_capsense_context_t * context);
    static cy_en_capsense_bist_status_t Cy_CapSense_SnsShortCheckAllSensors(
                    cy_stc_capsense_context_t * context);
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_SHORT_EN) */

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_HW_GROUP_EN)
        static void Cy_CapSense_BistSwitchHwConfig(
                        cy_en_capsense_bist_hw_config_t hwCfg,
                        uint8_t bistSenseGroup,
                        uint8_t bistScanMode,
                        cy_stc_capsense_context_t * context);

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_SHORT_EN)
        static void Cy_CapSense_BistSetPinDr(
                        cy_stc_capsense_pin_config_t const *ioPtr,
                        uint32_t value);
        static void Cy_CapSense_BistSetPinPc(
                        cy_stc_capsense_pin_config_t const *ioPtr,
                        uint32_t value);
    #endif

    static void Cy_CapSense_BistSwitchAllSnsPinState(
                    cy_en_capsense_bist_io_state_t desiredPinState,
                    const cy_stc_capsense_context_t * context);
    static void Cy_CapSense_BistSwitchAllExternalCapPinState(
                    cy_en_capsense_bist_io_state_t desiredPinState,
                    const cy_stc_capsense_context_t * context);
    void Cy_CapSense_BistSetAllSnsPinsState(
                    uint32_t desiredDriveMode,
                    uint32_t desiredPinOutput,
                    en_hsiom_sel_t desiredHsiom,
                    const cy_stc_capsense_context_t * context);
    void Cy_CapSense_BistSetAllCmodPinsState(
                    uint32_t desiredDriveMode,
                    uint32_t desiredPinOutput,
                    en_hsiom_sel_t desiredHsiom,
                    const cy_stc_capsense_context_t * context);

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
        static void Cy_CapSense_BistSwitchAllShieldPinState(
                        cy_en_capsense_bist_io_state_t desiredPinState,
                        const cy_stc_capsense_context_t * context);
        void Cy_CapSense_BistSetAllShieldPinsState(
                        uint32_t desiredDriveMode,
                        uint32_t desiredPinOutput,
                        en_hsiom_sel_t desiredHsiom,
                        const cy_stc_capsense_context_t * context);
    #endif

    static void Cy_CapSense_BistSetDmHsiomPinState(
                    cy_en_capsense_bist_io_state_t desiredPinState,
                    const cy_stc_capsense_context_t * context);
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_HW_GROUP_EN) */

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_ELTD_CAP_EN)
    static cy_en_capsense_bist_status_t Cy_CapSense_MeasureCapacitanceAllElectrodes(
                cy_stc_capsense_context_t * context);
#endif

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN)
    cy_en_capsense_bist_status_t Cy_CapSense_MeasureCapacitanceSlotSensorsInternal(
                uint32_t slotId,
                uint32_t snsFrameType,
                cy_stc_capsense_context_t * context);
    static cy_en_capsense_bist_status_t Cy_CapSense_MeasureCapacitanceAllSensors(
                cy_stc_capsense_context_t * context);
#endif

#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) || (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_ELTD_CAP_EN) || \
     ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN)))
    static uint32_t Cy_CapSense_BistWatchdogPeriodCalc(
                        const cy_stc_capsense_context_t * context);

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_ELTD_CAP_EN)
        static cy_en_capsense_bist_status_t Cy_CapSense_BistMeasureCapacitanceSensor(
                        uint32_t * cpPtr,
                        uint32_t snsFrameType,
                        cy_stc_capsense_context_t * context);
    #endif

    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) || \
         ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN)))
        static cy_en_capsense_bist_status_t Cy_CapSense_BistMeasureCapacitanceSlot(
                        uint32_t slotId,
                        uint32_t snsFrameType,
                        cy_stc_capsense_context_t * context);
    #endif
    static void Cy_CapSense_BistGenerateBaseConfig(
                    cy_stc_capsense_context_t * context);
    static void Cy_CapSense_BistGenerateSensorConfig(
                    uint32_t * ptrSensorCfg,
                    uint32_t snsFrameType,
                    cy_stc_capsense_context_t * context);
    static void Cy_CapSense_BistGenerateSnsCfgMaskReg(
                    const cy_stc_capsense_electrode_config_t * ptrEltdCfg,
                    uint32_t * ptrSensorCfg,
                    uint32_t cswFuncNum);
#endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) || (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_ELTD_CAP_EN) || \
           ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN))) */

#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_EXTERNAL_CAP_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_VDDA_EN))
    static cy_en_capsense_bist_status_t Cy_CapSense_BistMeasureCapacitanceCapRun(
                    uint32_t * ptrExtCapValue,
                    cy_stc_capsense_context_t * context);
    static void Cy_CapSense_BistGenerateBaseCmodConfig(
                    cy_stc_capsense_context_t * context);
    void Cy_CapSense_DischargeCmod(
                    GPIO_PRT_Type * portCmod,
                    uint32_t pinCmod,
                    cy_stc_capsense_context_t * context);
#endif

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_EXTERNAL_CAP_EN)
    static cy_en_capsense_bist_status_t Cy_CapSense_BistMeasureCapacitanceCapAll(
                    cy_stc_capsense_context_t * context);
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_EXTERNAL_CAP_EN) */

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_VDDA_EN)
    /* Measure VDDA test-related functions */
    static cy_en_capsense_bist_status_t Cy_CapSense_BistMeasureVddaRun(
                    cy_stc_capsense_context_t * context);
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_VDDA_EN) */

/** \} \endcond */


