zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_lp.c
    uint8_t cmod1Pin;
    uint8_t cmod2Pin;

    GPIO_PRT_Type * cmod1Port;
    GPIO_PRT_Type * cmod2Port;

    const cy_stc_capsense_common_config_t * ptrCommonCfg = context->ptrCommonConfig;

    /* Loop through all electrodes */
    for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
    {
        cmod1Port = ptrCommonCfg->ptrChConfig[curChIndex].portCmod1;
        cmod1Pin = ptrCommonCfg->ptrChConfig[curChIndex].pinCmod1;

        cmod2Port = ptrCommonCfg->ptrChConfig[curChIndex].portCmod2;
        cmod2Pin = ptrCommonCfg->ptrChConfig[curChIndex].pinCmod2;

        Cy_CapSense_SsConfigPinRegisters(cmod1Port, (uint32_t)cmod1Pin, desiredDriveMode, desiredHsiom, CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_EN);
        Cy_CapSense_SsConfigPinRegisters(cmod2Port, (uint32_t)cmod2Pin, desiredDriveMode, desiredHsiom, CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_EN);

        if (0u != desiredPinOutput)
        {
            Cy_GPIO_Set(cmod1Port, (uint32_t)cmod1Pin);
        }
        else
        {
            Cy_GPIO_Clr(cmod1Port, (uint32_t)cmod1Pin);
        }

        if (0u != desiredPinOutput)
        {
            Cy_GPIO_Set(cmod2Port, (uint32_t)cmod2Pin);
        }
        else
        {
            Cy_GPIO_Clr(cmod2Port, (uint32_t)cmod2Pin);
        }
    }
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_HW_GROUP_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_ELTD_CAP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_MeasureCapacitanceSensorElectrode_V3Lp
****************************************************************************//**
*
* Measures the specified CSD sensor / CSX electrode capacitance in femtofarads.
*
* This function measures the sensor capacitance for CSD widgets or the electrode
* capacitance for CSX
* widgets and returns the measurement status. For a CSX sensor, the
* measurement is done on either Rx or Tx electrode.
* For a CSD sensor, measurement is done on a sensor (refer to the
* eltdId parameter description).
* The function does not measure capacitances of Lx/Rx electrodes of the ISX widgets
* as they are electrically connected to the GND.
* The CY_CAPSENSE_BIST_BAD_PARAM_E status for such a widget is returned.
* If the specified sensor (electrode) is a ganged sensor, the capacitance
* is measured for all the pins ganged together that belong to this sensor
* (electrode).
*
* The measured capacitance is stored in the .eltdCap[] array.
* The .ptrEltdCapacitance field of the
* \ref cy_stc_capsense_widget_config_t structure contains a pointer to
* the first widget sensor (electrode) element within the .eltdCap[] array.
*
* In addition to the measuring sensor (electrode) capacitance, this function
* is used to identify various fault conditions with sensors such
* as electrically-opened or -shorted sensors. For example, the PCB track is
* broken or shorted to other nodes in the system - in all of these conditions,
* this function returns changed capacitance which can be compared
* against predetermined capacitance for the sensor to detect a
* fault condition.
*
* The sensor capacitance is measured independently of the sensor scan
* configuration. For the capacitance measurement, the CSD sensing method is used.
* The default scanning parameters are the following:
* * SnsClk divider (256) is the divider for the sensor clock frequency.
* * NumConv (100) is the number of sub-conversions.
* * The reference CDAC capacitance (887 fF) is equivalent to CDAC Code of 100u.
* * The compensation CDAC is disabled.
* * The CIC2 filter is disabled.
* * The dithering is disabled.
* * The chopping is disabled.
*
* The raw count is converted into capacitance using the following equation:
*
*  Cs = Rawcount * RefCDAC capacitance / NumConv
*
* where:
* * Cs is the sensor capacitance.
* * Rawcount is the measured raw count value.
*
* The minimum measurable input by this function is 1pF and the
* maximum is either 275pF or limited by the RC time constant
* (Cs < 1 / (4*5*SnsClk*R), where R is the total sensor series
* resistance that includes on-chip GPIO resistance ~500 Ohm and
* external series resistance). The measurement accuracy is about 30% and
* is defined by the RefCDAC tolerance.
*
* By default, all CAPSENSE&trade; sensors (electrodes) inherit regular
* scanning configuration. For example if the Inactive sensor
* connection parameter of the CSD sensing method is set to GND,
* sensors that are not being measured are set to the GND state.
* The inactive state can be changed in run-time by using
* the Cy_CapSense_SetInactiveElectrodeState() function.
*
* By default, the both Cmod1 and Cmod2 capacitors are used for the measurement.
*
* The sensor measurement can be done on all the electrodes using
* the Cy_CapSense_RunSelfTest() function along with
* the CY_CAPSENSE_BIST_ELTD_CAP_MASK mask.
*
* This function must not be called while the CAPSENSE&trade; MW is busy
* by another scan.
*
* \note
* This function is available only for the fifth-generation low power
* CAPSENSE&trade;.
*
* \param widgetId
* Specifies the ID number of the widget.
* A macro for the widget ID can be found in the
* CAPSENSE&trade; Configuration header file (cycfg_capsense.h) defined as
* CY_CAPSENSE_<WidgetName>_WDGT_ID.
*
* \param eltdId
* Specifies the ID of the electrode within the widget (sensorID for CSD
* widgets and Rx or Tx electrode ID for CSX widgets).
*
* For the CSD widgets, a macro for the sensor ID within the specified widget
* can be found in the CAPSENSE&trade; Configuration header file (cycfg_capsense.h)
* defined as CY_CAPSENSE_<WidgetName>_SNS<SensorNumber>_ID.
*
* For the CSX widgets, eltdId is an electrode ID and is defined as Rx ID
* or Tx ID. The first Rx in a widget corresponds to eltdId = 0, the
* second Rx in a widget corresponds to eltdId = 1, and so on.
* The last Tx in a widget corresponds to eltdId = (RxNum + TxNum - 1).
* Macros for Rx and Tx IDs can be found in the CAPSENSE&trade; Configuration header
* file (cycfg_capsense.h) defined as:
* * CapSense_<WidgetName>_RX<RXNumber>_ID
* * CapSense_<WidgetName>_TX<TXNumber>_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status of the test execution:
* - CY_CAPSENSE_BIST_SUCCESS_E          - The measurement completes
*                                         successfully, the result is valid.
* - CY_CAPSENSE_BIST_BAD_PARAM_E        - The input parameter is invalid.
*                                         The measurement was not executed.
* - CY_CAPSENSE_BIST_HW_BUSY_E          - The CAPSENSE&trade; HW block is busy with a
*                                         previous operation.
*                                         The measurement was not executed.
*
*******************************************************************************/
cy_en_capsense_bist_status_t Cy_CapSense_MeasureCapacitanceSensorElectrode_V3Lp(
                uint32_t widgetId,
                uint32_t eltdId,
                cy_stc_capsense_context_t * context)
{
    cy_en_capsense_bist_status_t result = CY_CAPSENSE_BIST_BAD_PARAM_E;
    uint32_t numWdgtElectrodes = 0u;
    uint32_t snsFrameType = CY_CAPSENSE_SNS_FRAME_ACTIVE;

    if (NULL != context)
    {
        if ((context->ptrCommonConfig->numWd > widgetId))
        {
            /* Get the total widget electrode number: for CSX it is numRows + numCols, for CSD it is totalNumSns */
            switch (context->ptrWdConfig[widgetId].senseMethod)
            {
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
                    case CY_CAPSENSE_CSD_GROUP:
                        result = CY_CAPSENSE_BIST_SUCCESS_E;
                        numWdgtElectrodes = context->ptrWdConfig[widgetId].numSns;
                        context->ptrBistContext->currentISC = context->ptrBistContext->intrEltdCapCsdISC;
                        break;
                #endif

                /* For CSX and ISX widgets, get the sum of Rx and Tx electrode numbers */
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                    case CY_CAPSENSE_CSX_GROUP:
                        result = CY_CAPSENSE_BIST_SUCCESS_E;
                        numWdgtElectrodes = context->ptrWdConfig[widgetId].numRows +
                                             (uint32_t)context->ptrWdConfig[widgetId].numCols;
                        context->ptrBistContext->currentISC = context->ptrBistContext->intrEltdCapCsxISC;
                        break;
                #endif

