zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_lp.c
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
                    case CY_CAPSENSE_ISX_GROUP:
                        /* exit with CY_CAPSENSE_BIST_BAD_PARAM_E */
                #endif

                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
                    case CY_CAPSENSE_WBX_GROUP:
                        /* exit with CY_CAPSENSE_BIST_BAD_PARAM_E */
                #endif
                default:
                    /* Do nothing */
                    break;
            }

            if ((numWdgtElectrodes > eltdId) && (CY_CAPSENSE_BIST_BAD_PARAM_E != result))
            {
                if (CY_CAPSENSE_NOT_BUSY == Cy_CapSense_IsBusy(context))
                {
                    /* Set the BUSY status and switch the HW configuration to BIST */
                    context->ptrCommonContext->status = CY_CAPSENSE_BUSY | CY_CAPSENSE_MW_STATE_BIST_MASK;
                    (void)Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_BIST_FUNCTIONALITY, context);
                    /* Store the the pointer to the electrode pin configuration to the Bist context structure */
                    context->ptrBistContext->curPtrEltdCfg = &context->ptrWdConfig[widgetId].ptrEltdConfig[eltdId];
                    /* Switch the HW configuration to the sensor electrode capacitance measurement */
                    Cy_CapSense_BistSwitchHwConfig(CY_CAPSENSE_BIST_HW_ELTD_CAP_E,
                                                   CY_CAPSENSE_CSD_GROUP,
                                                   CY_CAPSENSE_BIST_CAP_ELTD_SCAN,
                                                   context);
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
                        if ((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E == context->ptrWdConfig[widgetId].wdType)
                        {
                            snsFrameType = CY_CAPSENSE_SNS_FRAME_LOW_POWER;
                        }
                    #endif
                    result = Cy_CapSense_BistMeasureCapacitanceSensor(
                                &context->ptrWdConfig[widgetId].ptrEltdCapacitance[eltdId],
                                snsFrameType,
                                context);
                    /* Clear the BUSY flag */
                    context->ptrCommonContext->status = CY_CAPSENSE_NOT_BUSY;
                }
                else
                {
                    result = CY_CAPSENSE_BIST_HW_BUSY_E;
                }
            }
        }
    }

    return result;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_ELTD_CAP_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_MeasureCapacitanceAllSensors
****************************************************************************//**
*
* This internal function measures all the sensor capacitances
* (Cp for CSD sensors and Cm for CSX sensors).
*
* This function measures capacitances of all the sensors by using the
* Cy_CapSense_MeasureCapacitanceSlotSensors() function.
* The function stores sensor capacitance values in femtofarads
* in the snsCap array defined
* in the cycfg_capsense.c file. The pointer to the first element of the snsCap
* array that contains the widget sensor capacitances is stored
* in the .ptrSnsCapacitance field of the cy_stc_capsense_widget_config_t
* structure.
* The function is called by the Cy_CapSense_RunSelfTest() function.
*
* \note
* Rx/Lx electrodes for ISX widgets are excluded from measuring.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the measuring process:
* - CY_CAPSENSE_BIST_SUCCESS_E if all the measurements passed successfully.
* - CY_CAPSENSE_BIST_FAIL_E if any measurement was failed.
* - CY_CAPSENSE_BIST_BAD_PARAM_E if current sense method is
*   not supported.
*
*******************************************************************************/
static cy_en_capsense_bist_status_t Cy_CapSense_MeasureCapacitanceAllSensors(
                cy_stc_capsense_context_t * context)
{
    uint32_t slotId;
    uint32_t widgetId;
    cy_en_capsense_bist_status_t result = CY_CAPSENSE_BIST_SUCCESS_E;
    const cy_stc_capsense_scan_slot_t * ptrScanSlots = context->ptrScanSlots;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        const cy_stc_capsense_scan_slot_t * ptrLpScanSlots = context->ptrLpScanSlots;
    #endif

    /* Loop through all the slots */
    for (slotId = 0u; slotId < CY_CAPSENSE_SLOT_COUNT; slotId++)
    {
        widgetId = ptrScanSlots[slotId].wdId;
        if ((CY_CAPSENSE_ISX_GROUP != context->ptrWdConfig[widgetId].senseMethod) &&
            (CY_CAPSENSE_WBX_GROUP != context->ptrWdConfig[widgetId].senseMethod))
        {
            if (CY_CAPSENSE_BIST_SUCCESS_E != Cy_CapSense_MeasureCapacitanceSlotSensors_V3Lp(slotId, 0u, context))
            {
                if (CY_CAPSENSE_BIST_SUCCESS_E == result)
                {
                    result = CY_CAPSENSE_BIST_FAIL_E;
                }
            }
        }
        else
        {
            result = CY_CAPSENSE_BIST_BAD_PARAM_E;
        }
    }

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        for (slotId = 0u; slotId < CY_CAPSENSE_SLOT_LP_COUNT; slotId++)
        {
            widgetId = ptrLpScanSlots[slotId].wdId;
            if ((CY_CAPSENSE_ISX_GROUP != context->ptrWdConfig[widgetId].senseMethod) &&
                (CY_CAPSENSE_WBX_GROUP != context->ptrWdConfig[widgetId].senseMethod))
            {
                if (CY_CAPSENSE_BIST_SUCCESS_E != Cy_CapSense_MeasureCapacitanceLpSlotSensors(slotId, context))
                {
                    if (CY_CAPSENSE_BIST_SUCCESS_E == result)
                    {
                        result = CY_CAPSENSE_BIST_FAIL_E;
                    }
                }
            }
        }
    #endif

    return result;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_ELTD_CAP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_MeasureCapacitanceAllElectrodes
****************************************************************************//**
*
* This internal function measures all the electrodes (sensor for CSD widgets and
* Rx/Tx electrodes for CSX widgets) parasitic capacitance (Cp).
*
* This function measures Cp of all the electrodes by using the
* Cy_CapSense_MeasureCapacitanceSensorElectrode() function.
* The function stores the Cp values in femtofarads in the eltdCap array defined
* in the cycfg_capsense.c file. The pointer to the first element of the eltdCap
* array that contains the widget electrode capacitances is stored
* in the .ptrEltdCapacitance field of the cy_stc_capsense_widget_config_t
* structure.
* The function is called by the Cy_CapSense_RunSelfTest() function.
*
* \note
* Rx/Lx electrodes for ISX widgets are excluded from measuring.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the measuring process:
* - CY_CAPSENSE_BIST_SUCCESS_E if all the measurements passed successfully.
* - CY_CAPSENSE_BIST_FAIL_E if any measurement was failed.
* - CY_CAPSENSE_BIST_BAD_PARAM_E if current sense method is
*   not supported.
*
*******************************************************************************/
static cy_en_capsense_bist_status_t Cy_CapSense_MeasureCapacitanceAllElectrodes(
                cy_stc_capsense_context_t * context)
{
    uint32_t widgetId;
    uint32_t electrodeId;
    uint32_t numWdgtElectrodes;
    cy_en_capsense_bist_status_t result = CY_CAPSENSE_BIST_SUCCESS_E;

