zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_lp.c
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
                        case CY_CAPSENSE_ISX_GROUP:
                            /* exit with CY_CAPSENSE_BIST_BAD_PARAM_E */
                    #endif

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
                        case CY_CAPSENSE_WBX_GROUP:
                            /* exit with CY_CAPSENSE_BIST_BAD_PARAM_E */
                    #endif
                    default:
                        /* Do nothing */
                        break;
                }

                if (CY_CAPSENSE_BIST_BAD_PARAM_E != result)
                {
                    /* Switch the HW resource configuration to the sensor element capacitance measurement */
                    Cy_CapSense_BistSwitchHwConfig(CY_CAPSENSE_BIST_HW_ELTD_CAP_E,
                                                    context->ptrWdConfig[wdIndex].senseMethod,
                                                    CY_CAPSENSE_BIST_CAP_SLOT_SCAN,
                                                    context);
                    result = Cy_CapSense_BistMeasureCapacitanceSlot(slotId, snsFrameType, context);
                }
                /* Clear the BUSY flag */
                context->ptrCommonContext->status = CY_CAPSENSE_NOT_BUSY;
            }
            else
            {
                result = CY_CAPSENSE_BIST_HW_BUSY_E;
            }
        }
    }

    return result;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_ELTD_CAP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureCapacitanceSensor
****************************************************************************//**
*
* This internal function measures a capacitance attached to AMUXBUS.
*
* The function measures Cp of a certain electrode (CSD sensor or CSX
* Rx/Tx electrode) by using CSD FW mode and defined scan configuration,
* sense clock frequency and resolution.
* The range for sensor measuring is 1 to 275 pF.
* The function performs the CSD scan with the fixed CDAC value. This provides
* a possibility of classical raw counts formula usage for the capacitance
* calculation. The function stores the Cp value
* in the corresponding element of the eltdCap[CY_CAPSENSE_ELTD_COUNT] array.
*
* \param cpPtr
* The pointer to the uint32_t to store measured value of the capacitance.
*
* \param snsFrameType
* The Sensor Frame type:
* * CY_CAPSENSE_SNS_FRAME_ACTIVE     - Sensor frame for Active slot
* * CY_CAPSENSE_SNS_FRAME_LOW_POWER  - Sensor frame for Low Power slot
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status of the test execution:
* - CY_CAPSENSE_BIST_SUCCESS_E - The measurement is completed
*                                successfully, the result is valid.
* - CY_CAPSENSE_BIST_TIMEOUT_E - The scan reached the timeout. It can be caused
*                                by a measured capacitance short or HW block
*                                failure or invalid configuration. You may need
*                                to repeat the measurement after the issue fix.
*                                The result is set to zero.
* - CY_CAPSENSE_BIST_ERROR_E   - The was an overflow or bad conversions during
*                                the scan. It can be caused
*                                by a measured capacitance short or HW block
*                                failure or invalid configuration. You may need
*                                to repeat the measurement after the issue fix.
*                                The result is set to zero.
*
*******************************************************************************/
static cy_en_capsense_bist_status_t Cy_CapSense_BistMeasureCapacitanceSensor(
                uint32_t * cpPtr,
                uint32_t snsFrameType,
                cy_stc_capsense_context_t * context)
{
    uint32_t cp;
    cy_en_capsense_bist_status_t result = CY_CAPSENSE_BIST_TIMEOUT_E;
    const cy_stc_capsense_common_config_t * ptrCommonCfg = context->ptrCommonConfig;
    MSCLP_Type * ptrHwBase = ptrCommonCfg->ptrChConfig->ptrHwBase;
    uint32_t rawCountTmp;
    uint32_t watchdog;
    uint32_t cdacTrim;
    uint32_t sensorFrame[CY_MSCLP_6_SNS_REGS];

    /* Setup scan parameters: Ref CDAC code for Cp measurement */
    context->ptrBistContext->eltdCapRefCdac = CY_CAPSENSE_BIST_ELTD_CAP_REF_CDAC_DEFAULT;

    Cy_CapSense_BistGenerateSensorConfig(&sensorFrame[0u], snsFrameType, context);
    Cy_CapSense_StartCpuScan((const uint32_t *)sensorFrame, context);

    watchdog = Cy_CapSense_BistWatchdogPeriodCalc(context);
    watchdog = Cy_CapSense_WaitEndOfCpuScan(watchdog, context);

    /* Check if the watchdog timeout happened */
    if (0u == watchdog)
    {
        result = CY_CAPSENSE_BIST_TIMEOUT_E;
    }
    else
    {
        /* Read raw counts */
        rawCountTmp = ptrHwBase->SNS.RESULT_FIFO_RD;

        /* Check for overflow */
        if (MSCLP_SNS_RESULT_FIFO_RD_OVERFLOW_Msk == (rawCountTmp & MSCLP_SNS_RESULT_FIFO_RD_OVERFLOW_Msk))
        {
            result = CY_CAPSENSE_BIST_ERROR_E;
        }
        else
        {
            rawCountTmp &= MSCLP_SNS_RESULT_FIFO_RD_RAW_COUNT_Msk;
            result = CY_CAPSENSE_BIST_SUCCESS_E;
        }
    }

    /* Disable HW IP */
    ptrHwBase->CTL &= (~MSCLP_CTL_ENABLED_Msk);

    /* Check for timeout and if no, then calculate capacitance and store the value to the data structure */
    if (CY_CAPSENSE_BIST_SUCCESS_E == result)
    {
        cp = rawCountTmp * CY_CAPSENSE_REF_CDAC_LSB_X100;
        cp /= context->ptrBistContext->eltdCapSubConvNum;
        cp *= context->ptrBistContext->eltdCapRefCdac;
        cp /= CY_CAPSENSE_CONVERSION_HECTO;

        /* Adds CDAC trimming */
        if (0u != context->ptrCommonContext->cdacTrimCoefficient)
        {
            cdacTrim = context->ptrCommonContext->cdacTrimCoefficient;

            if (0u != cdacTrim)
            {
                /* Scales result with decreased resolution to avoid overflow */
                cp = (uint32_t)(cp << (CY_CAPSENSE_CDAC_TRIM_OFFSET - CY_CAPSENSE_CDAC_TRIM_OVERFLOW_OFFSET));
                /* Rounding to the nearest */
                cp += cdacTrim >> (CY_CAPSENSE_CDAC_TRIM_OVERFLOW_OFFSET + 1u);
                cp /= cdacTrim >> CY_CAPSENSE_CDAC_TRIM_OVERFLOW_OFFSET;
            }
        }

        if (((uint32_t)CY_CAPSENSE_BIST_CP_MAX_VALUE) < cp)
        {
            cp = (uint32_t)CY_CAPSENSE_BIST_CP_MAX_VALUE;
        }
        *cpPtr = (uint32_t)cp;
    }
    else
    {
        *cpPtr = 0u;
    }

    return result;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_ELTD_CAP_EN_EN) */


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) || \
    ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN)))
/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureCapacitanceSlot
****************************************************************************//**
*
* This internal function measures slot sensor capacitances.
*
* The function measures Cp of a certain CSD sensor or shield
* or Cm of a certain CSX sensor by using the predefined scan configuration.
* The range for sensor measuring is 1 to 275 pF for CSD/CSX sensors and
* 1160 pF for shield electrodes.
* The function performs the CSD or CSX scan with fixed reference CDAC values
* (100u and 50u respectively) and 200u for shield electrodes' capacitance
* measurements. The function stores the Cp or Cm value
* in the corresponding element
* of the cy_capsense_snsCap[CY_CAPSENSE_SENSOR_COUNT] array and
* Cshield values for each channel
* in the corresponding element
* of the cy_capsense_shieldCap[CY_CAPSENSE_TOTAL_CH_NUMBER] array.
* The pointer to the first sensor capacitance value of a widget is
* in the .ptrSnsCapacitance field of the \ref cy_stc_capsense_widget_config_t
* structure.
*
* \param slotId
* Specifies the ID number of the slot to measure sensor capacitance.
* The slot ID should be in the admissible range.
*
* \param snsFrameType
* The Sensor Frame type:
* * CY_CAPSENSE_SNS_FRAME_ACTIVE     - Sensor frame for Active slot
* * CY_CAPSENSE_SNS_FRAME_LOW_POWER  - Sensor frame for Low Power slot
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status of the test execution:
* - CY_CAPSENSE_BIST_SUCCESS_E - The measurement completes
*                                successfully, the result is valid.
* - CY_CAPSENSE_BIST_BAD_PARAM_E - The input parameter is invalid.
* - CY_CAPSENSE_BIST_TIMEOUT_E - The scan reached the timeout. It can be caused
*                                by a measured capacitance short or The CAPSENSE&trade; HW block
*                                failure or invalid configuration. You may need to
*                                repeat the measurement after the issue fix.
*                                The result is not affected.
* - CY_CAPSENSE_BIST_ERROR_E   - The was an overflow or bad conversions during
*                                the scan. It can be caused
*                                by a measured capacitance short or HW block
*                                failure or invalid configuration. You may need
*                                to repeat the measurement after the issue fix.
*                                The result is not affected.
*
*******************************************************************************/
static cy_en_capsense_bist_status_t Cy_CapSense_BistMeasureCapacitanceSlot(
                uint32_t slotId,
                uint32_t snsFrameType,
                cy_stc_capsense_context_t * context)
{

    cy_en_capsense_bist_status_t result = CY_CAPSENSE_BIST_TIMEOUT_E;
    const cy_stc_capsense_common_config_t * ptrCommonCfg = context->ptrCommonConfig;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;
    const cy_stc_capsense_scan_slot_t * ptrScanSlots;
    MSCLP_Type * ptrHwBase = ptrCommonCfg->ptrChConfig->ptrHwBase;
    uint32_t cp;
    uint32_t watchdog;
    uint32_t rawCountTmp;
    uint32_t wdIndex;
    uint32_t snsIndex;
    uint32_t cdacTrim;
    uint32_t sensorFrame[CY_MSCLP_6_SNS_REGS];
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        ptrScanSlots = (snsFrameType == CY_CAPSENSE_SNS_FRAME_ACTIVE) ? (context->ptrScanSlots) : (context->ptrLpScanSlots);
    #else
        ptrScanSlots = context->ptrScanSlots;
        (void)snsFrameType;
    #endif
    wdIndex = ptrScanSlots[slotId].wdId;
    snsIndex = ptrScanSlots[slotId].snsId;
    ptrWdCfg = &context->ptrWdConfig[wdIndex];

    /* Setup scan parameters: Ref CDAC code for shield or electrode Cp measurement */
    if (CY_CAPSENSE_BIST_CAP_SHIELD_SCAN == context->ptrBistContext->eltdCapScanMode)
    {
        context->ptrBistContext->eltdCapRefCdac = CY_CAPSENSE_BIST_SHIELD_CAP_REF_CDAC_DEFAULT;
    }
    /* The CSD or CSX group is the same for all slot sensors */
    else if (CY_CAPSENSE_CSX_GROUP == ptrWdCfg->senseMethod)
    {
        context->ptrBistContext->eltdCapRefCdac = CY_CAPSENSE_BIST_MUTUAL_CAP_REF_CDAC_DEFAULT;
    }
    else
    {
        context->ptrBistContext->eltdCapRefCdac = CY_CAPSENSE_BIST_ELTD_CAP_REF_CDAC_DEFAULT;
    }

