zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_lp.c
    Cy_CapSense_BistGenerateSensorConfig(&sensorFrame[0u], snsFrameType, context);
    Cy_CapSense_StartCpuScan((const uint32_t *)sensorFrame, context);

    watchdog = Cy_CapSense_BistWatchdogPeriodCalc(context);
    watchdog = Cy_CapSense_WaitEndOfCpuScan(watchdog, context);

    /* Check if the watchdog timeout happened */
    if (0u == watchdog)
    {
        result = CY_CAPSENSE_BIST_TIMEOUT_E;
    }
    else
    {
        /* Read raw counts */
        rawCountTmp = ptrHwBase->SNS.RESULT_FIFO_RD;

        /* Check for overflow */
        if (MSCLP_SNS_RESULT_FIFO_RD_OVERFLOW_Msk == (rawCountTmp & MSCLP_SNS_RESULT_FIFO_RD_OVERFLOW_Msk))
        {
            result = CY_CAPSENSE_BIST_ERROR_E;
        }
        else
        {
            rawCountTmp &= MSCLP_SNS_RESULT_FIFO_RD_RAW_COUNT_Msk;
            result = CY_CAPSENSE_BIST_SUCCESS_E;
        }
    }

    /* Disable HW IP */
    ptrHwBase->CTL &= (~MSCLP_CTL_ENABLED_Msk);

    /* Calculate capacitance and store the value to the data structure */
    if (CY_CAPSENSE_BIST_SUCCESS_E == result)
    {
        cp = CY_CAPSENSE_REF_CDAC_LSB_X100 * rawCountTmp;
        cp /= context->ptrBistContext->eltdCapSubConvNum;
        cp *= context->ptrBistContext->eltdCapRefCdac;
        cp /= CY_CAPSENSE_CONVERSION_HECTO;

        /* Adds CDAC trimming */
        if (0u != context->ptrCommonContext->cdacTrimCoefficient)
        {
            cdacTrim = context->ptrCommonContext->cdacTrimCoefficient;

            if (0u != cdacTrim)
            {
                /* Scales result with decreased resolution to avoid overflow */
                cp = (uint32_t)(cp << (CY_CAPSENSE_CDAC_TRIM_OFFSET - CY_CAPSENSE_CDAC_TRIM_OVERFLOW_OFFSET));
                /* Rounding to the nearest */
                cp += cdacTrim >> (CY_CAPSENSE_CDAC_TRIM_OVERFLOW_OFFSET + 1u);
                cp /= cdacTrim >> CY_CAPSENSE_CDAC_TRIM_OVERFLOW_OFFSET;
            }
        }

        /* Store the Cp value in the appropriate structure */
        if ((CY_CAPSENSE_BIST_CAP_SHIELD_SCAN != context->ptrBistContext->eltdCapScanMode))
        {
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                /* Divide the result by 2 for the FW CSX scanning method */
                if (CY_CAPSENSE_CSX_GROUP == ptrWdCfg->senseMethod)
                {
                    cp /= CY_CAPSENSE_DIVIDER_TWO;
                }
            #endif

            if (((uint32_t)CY_CAPSENSE_BIST_CP_MAX_VALUE) < cp)
            {
                cp = (uint32_t)CY_CAPSENSE_BIST_CP_MAX_VALUE;
            }
            ptrWdCfg->ptrSnsCapacitance[snsIndex] = (uint32_t)cp;
        }
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
            else
            {
                if (((uint32_t)CY_CAPSENSE_BIST_CSH_MAX_VALUE) < cp)
                {
                    cp = (uint32_t)CY_CAPSENSE_BIST_CSH_MAX_VALUE;
                }
                *context->ptrBistContext->ptrChShieldCap = (uint32_t)cp;
            }
        #endif
    }

    return result;
}
#endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) || \
          ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && \
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN))) */


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) || (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_ELTD_CAP_EN) || \
     ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN)))
/*******************************************************************************
* Function Name: Cy_CapSense_BistGenerateBaseConfig
****************************************************************************//**
*
* Changes the configuration for all registers that have to be changed
* one-time to initialize the MSC block for BIST scan.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
*
*******************************************************************************/
static void Cy_CapSense_BistGenerateBaseConfig(
                cy_stc_capsense_context_t * context)
{
    cy_stc_msclp_base_config_t cy_capsense_smTemplate = CY_CAPSENSE_SENSING_METHOD_BASE_TEMPLATE;
    const cy_stc_msclp_mode_config_t modeArr[CY_CAPSENSE_REG_MODE_NUMBER] = CY_CAPSENSE_SM_MODES_ARR;
    cy_stc_msclp_base_config_t * ptrTemplateCfg = &cy_capsense_smTemplate;
    MSCLP_Type * ptrHwBase = context->ptrCommonConfig->ptrChConfig->ptrHwBase;

    /* Check for modClk divider value */
    if (1u == context->ptrBistContext->eltdCapModClk)
    {
        ptrTemplateCfg->ctl |= MSCLP_CTL_CLK_MSC_RATIO_Msk;
    }
    else
    {
        ptrTemplateCfg->ctl &= ~MSCLP_CTL_CLK_MSC_RATIO_Msk;
    }
    ptrTemplateCfg->imoCtl |= _VAL2FLD(MSCLP_IMO_CTL_CLOCK_MSC_DIV, (uint32_t)context->ptrBistContext->eltdCapModClk - 1u);

    /* Generating the common configuration for the BIST epilogue cycle number */
    if (0u < context->ptrBistContext->eltdCapNumEpiCycles)
    {
        ptrTemplateCfg->scanCtl2 |= (uint32_t)context->ptrBistContext->eltdCapNumEpiCycles << MSCLP_SCAN_CTL2_NUM_EPI_KREF_DELAY_Pos;
    }
    else
    {
        ptrTemplateCfg->scanCtl2 |= (uint32_t)(1uL << MSCLP_SCAN_CTL2_NUM_EPI_KREF_DELAY_Pos);
    }

    /* Generating the common configuration for the coarse initialization and coarse short phase */
    ptrTemplateCfg->initCtl1 |= (uint32_t)context->ptrBistContext->eltdCapNumCoarseInitChargeCycles <<
                                                                MSCLP_INIT_CTL1_NUM_INIT_CMOD_12_RAIL_CYCLES_Pos;
    ptrTemplateCfg->initCtl1 |= (uint32_t)context->ptrBistContext->eltdCapNumCoarseInitSettleCycles <<
                                                                MSCLP_INIT_CTL1_NUM_INIT_CMOD_12_SHORT_CYCLES_Pos;
    ptrTemplateCfg->initCtl3 |= CY_CAPSENSE_CMOD12_PAIR_SELECTION << MSCLP_INIT_CTL3_CMOD_SEL_Pos;
    ptrTemplateCfg->initCtl3 |= (uint32_t)context->ptrInternalContext->numProOffsetCycles << MSCLP_INIT_CTL3_NUM_PRO_OFFSET_CYCLES_Pos;

