zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_lp.c
    /*
    * Generating the common configuration for the number of sub-conversions to be run during the PRO_DUMMY phase and
    * the modClk period number during the PRO_WAIT phase.
    */
    ptrTemplateCfg->initCtl4 |= (((uint32_t)context->ptrBistContext->eltdCapNumFineInitCycles <<
                                                                  MSCLP_INIT_CTL4_NUM_PRO_DUMMY_SUB_CONVS_Pos) |
                                 ((uint32_t)context->ptrBistContext->eltdCapNumFineInitWaitCycles <<
                                                                  MSCLP_INIT_CTL4_NUM_PRO_WAIT_KREF_DELAY_Pos));

    /* Set switch control functions */
    ptrTemplateCfg->swSelCswFunc[CY_CAPSENSE_CTRLMUX_PIN_STATE_GND]     = CY_CAPSENSE_SM_REG_SW_SEL_CSW0_GND_VALUE;
    ptrTemplateCfg->swSelCswFunc[CY_CAPSENSE_CTRLMUX_PIN_STATE_HIGH_Z]  = CY_CAPSENSE_SM_REG_SW_SEL_CSW1_HIGH_Z_VALUE;
    ptrTemplateCfg->swSelCswFunc[CY_CAPSENSE_CTRLMUX_PIN_STATE_TX]      = CY_CAPSENSE_SM_REG_SW_SEL_CSW3_CSX_TX_VALUE;
    ptrTemplateCfg->swSelCswFunc[CY_CAPSENSE_CTRLMUX_PIN_STATE_RX]      = CY_CAPSENSE_SM_REG_SW_SEL_CSW2_CSX_RX_VALUE;
    ptrTemplateCfg->swSelCswFunc[CY_CAPSENSE_CTRLMUX_PIN_STATE_SNS]     = CY_CAPSENSE_SM_REG_SW_SEL_CSW5_CSD_SNS_VALUE;
    ptrTemplateCfg->swSelCswFunc[CY_CAPSENSE_CTRLMUX_PIN_STATE_VDDA2]   = CY_CAPSENSE_SM_REG_SW_SEL_CSW10_VDDA2_VALUE;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
        if (CY_CAPSENSE_SHIELD_ACTIVE == context->ptrCommonConfig->csdShieldMode)
        {
            /* Active Shield mode */
            ptrTemplateCfg->swSelCswFunc[CY_CAPSENSE_CTRLMUX_PIN_STATE_SHIELD] = CY_CAPSENSE_SM_REG_SW_SEL_CSW8_ACT_SHLD_VALUE;
        }
        else
        {
            /* Passive Shield mode */
            ptrTemplateCfg->swSelCswFunc[CY_CAPSENSE_CTRLMUX_PIN_STATE_SHIELD] = CY_CAPSENSE_SM_REG_SW_SEL_CSW9_PAS_SHLD_VALUE;
        }
    #endif

    /* Set mode configuration */
    ptrTemplateCfg->mode[CY_CAPSENSE_REG_MODE_CSD] = modeArr[CY_CAPSENSE_REG_MODE_CSD];
    ptrTemplateCfg->mode[CY_CAPSENSE_REG_MODE_CSX] = modeArr[CY_CAPSENSE_REG_MODE_CSX];
    ptrTemplateCfg->mode[CY_CAPSENSE_REG_MODE_ISX] = modeArr[CY_CAPSENSE_REG_MODE_ISX];
    
    if (CY_CAPSENSE_BIST_IO_VDDA2_E == context->ptrBistContext->currentISC)
    {
        if ((CY_CAPSENSE_BIST_CAP_ELTD_SCAN == context->ptrBistContext->eltdCapScanMode) ||
            (CY_CAPSENSE_CSD_GROUP == context->ptrBistContext->eltdCapSenseGroup))
        {
            /* Close the reference to filter switch for CSD sensing mode */
            ptrTemplateCfg->mode[CY_CAPSENSE_REG_MODE_CSD].swSelSh |= MSCLP_MODE_SW_SEL_SH_SOMB_Msk;
        }
        else
        {
            /* Close the reference to filter switch for CSX sensing mode */
            ptrTemplateCfg->mode[CY_CAPSENSE_REG_MODE_CSX].swSelSh |= MSCLP_MODE_SW_SEL_SH_SOMB_Msk;
        }
    }

    (void)Cy_MSCLP_Configure(ptrHwBase,
                       ptrTemplateCfg,
                       CY_MSCLP_CAPSENSE_KEY,
                       context->ptrCommonConfig->ptrChConfig->ptrHwContext);

    Cy_CapSense_SetupCpuOperatingMode(context);
}
#endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) || (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_ELTD_CAP_EN) || \
           ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN))) */


 #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) || (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_ELTD_CAP_EN) || \
     ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN)))
/*******************************************************************************
* Function Name: Cy_CapSense_BistGenerateSensorConfig
****************************************************************************//**
*
* Generates the configuration for registers that have to be configured to start
* a scan for a single sensor. It is used the next sensor configuration for BIST
* scan:
* - CIC2 filter is off
* - is used mode structure 0u
* - Multi-channel mode is off
* - System level chopping is off
* - Coarse Init Bypass is off
*
* \param ptrSensorCfg
* Specifies the pointer to the sensor configuration to be filled.
*
* \param snsFrameType
* The Sensor Frame type:
* * CY_CAPSENSE_SNS_FRAME_ACTIVE     - Sensor frame for Active slot
* * CY_CAPSENSE_SNS_FRAME_LOW_POWER  - Sensor frame for Low Power slot
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
*
*******************************************************************************/
static void Cy_CapSense_BistGenerateSensorConfig(
                uint32_t * ptrSensorCfg,
                uint32_t snsFrameType,
                cy_stc_capsense_context_t * context)
{
    uint32_t modeSel;
    uint32_t snsClkVal;
    uint32_t *ptrSensorCfgLocal = ptrSensorCfg;
    uint32_t i;
    uint32_t padMask = 0u;
    uint32_t cswFuncNum = 0u;
    uint32_t slotStcWdgtIdx;
    uint32_t slotStcSnsIdx;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;
    const cy_stc_capsense_scan_slot_t * ptrScanSlots;
    const cy_stc_capsense_electrode_config_t * ptrEltdCfg;
    const cy_stc_capsense_pin_config_t * ptrPinCfg = context->ptrPinConfig;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
        uint32_t padMaskIsx = 0u;
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
        uint32_t padMaskWbx = 0u;
    #endif

    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN) || (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN))
        uint32_t numEltd;
        uint32_t eltdIndex;
        uint32_t wdIndex;
        uint32_t snsMethod;
        cy_stc_capsense_electrode_config_t const * eltdPinCfg;
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        ptrScanSlots = (snsFrameType == CY_CAPSENSE_SNS_FRAME_ACTIVE) ? (context->ptrScanSlots) : (context->ptrLpScanSlots);
    #else
        ptrScanSlots = context->ptrScanSlots;
        (void)snsFrameType;
    #endif
    slotStcWdgtIdx = ptrScanSlots[context->ptrBistContext->curBistSlotId].wdId;
    slotStcSnsIdx =  ptrScanSlots[context->ptrBistContext->curBistSlotId].snsId;
    ptrWdCfg = &context->ptrWdConfig[slotStcWdgtIdx];

    /* Clear the sensor configuration structure */
    for (i = 0u; i < CY_MSCLP_6_SNS_REGS; i++)
    {
        ptrSensorCfg[i] = 0u;
    }

