zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_lp.c
    /* CapDAC configuration */
    ptrSensorCfgLocal[CY_CAPSENSE_SNS_CDAC_CTL_INDEX] =
            (_VAL2FLD(MSCLP_SNS_SNS_CDAC_CTL_SEL_RE, context->ptrBistContext->eltdCapRefCdac) |
             (CY_CAPSENSE_SM_REG_SNS_SNS_CDAC_CTL_FLD_CLOCK_REF_RATE << MSCLP_SNS_SNS_CDAC_CTL_CLOCK_REF_RATE_Pos));

    if ((CY_CAPSENSE_BIST_CAP_ELTD_SCAN == context->ptrBistContext->eltdCapScanMode) ||
        (CY_CAPSENSE_BIST_CAP_SHIELD_SCAN == context->ptrBistContext->eltdCapScanMode))
    {
        modeSel = CY_CAPSENSE_REG_MODE_CSD;
    }
    else
    {
        switch (ptrWdCfg->senseMethod)
        {
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
                case CY_CAPSENSE_CSD_GROUP:
                    modeSel = CY_CAPSENSE_REG_MODE_CSD;
                    break;
            #endif

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                case CY_CAPSENSE_CSX_GROUP:
                    modeSel = CY_CAPSENSE_REG_MODE_CSX;
                    break;
            #endif

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
                case CY_CAPSENSE_ISX_GROUP:
                    modeSel = CY_CAPSENSE_REG_MODE_ISX;
                    break;
            #endif

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
                case CY_CAPSENSE_WBX_GROUP:
                    modeSel = CY_CAPSENSE_REG_MODE_WBX;
                    break;
            #endif

            default:
                modeSel = CY_CAPSENSE_REG_MODE_CSD;
                break;
        }
    }

    snsClkVal = context->ptrBistContext->eltdCapSnsClk;
    if (CY_CAPSENSE_BIST_CAP_SHIELD_SCAN == context->ptrBistContext->eltdCapScanMode)
    {
        snsClkVal = CY_CAPSENSE_BIST_SHIELD_CAP_SNSCLK_DIV_DEFAULT;
    }
    snsClkVal--;

    ptrSensorCfgLocal[CY_CAPSENSE_SNS_SCAN_CTL_INDEX] = _VAL2FLD(MSCLP_SNS_SNS_SCAN_CTL_NUM_SUB_CONVS, (uint32_t)context->ptrBistContext->eltdCapSubConvNum - 1u) |
                                                        _VAL2FLD(MSCLP_SNS_SNS_SCAN_CTL_COMP_DIV, (uint32_t)snsClkVal); /* Compensation CDAC Divider set to BIST Sns clock divider */
    ptrSensorCfgLocal[CY_CAPSENSE_SNS_CTL_INDEX] = _VAL2FLD(MSCLP_SNS_SNS_CTL_SENSE_MODE_SEL, modeSel) |
                                                   _VAL2FLD(MSCLP_SNS_SNS_CTL_SENSE_DIV, snsClkVal);

    /* Create mask for all project electrodes */
    for (i = 0u; i < context->ptrCommonConfig->numPin; i++)
    {
        padMask |= (0x01uL << ptrPinCfg->padNumber);
        ptrPinCfg++;
    }

    /* Add to mask all shield electrodes (if present) */
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
        ptrPinCfg = context->ptrShieldPinConfig;
        for (i = 0u; i < context->ptrCommonConfig->csdShieldNumPin; i++)
        {
            padMask |= (0x01uL << ptrPinCfg->padNumber);
            ptrPinCfg++;
        }
    #endif /*  (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) */

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
        /* Create separate inactive mask of ISX pins only */
        for (wdIndex = 0u; wdIndex < context->ptrCommonConfig->numWd; wdIndex++)
        {
            snsMethod = context->ptrWdConfig[wdIndex].senseMethod;
            if (CY_CAPSENSE_ISX_GROUP == snsMethod)
            {
                numEltd = (uint32_t)context->ptrWdConfig[wdIndex].numRows + context->ptrWdConfig[wdIndex].numCols;
                eltdPinCfg = ptrWdCfg->ptrEltdConfig;

                for (eltdIndex = 0u; eltdIndex < numEltd; eltdIndex++)
                {
                    /* Loop through all pads for this electrode (ganged sensor) */
                    for (i = 0u; i < eltdPinCfg->numPins; i++)
                    {
                        padMaskIsx |= (0x01uL << eltdPinCfg->ptrPin[i].padNumber);
                    }
                    eltdPinCfg++;
                }
            }
        }
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN) */

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
    /* Create separate inactive mask of WBX pins only */
    for (wdIndex = 0u; wdIndex < context->ptrCommonConfig->numWd; wdIndex++)
    {
        snsMethod = context->ptrWdConfig[wdIndex].senseMethod;
        if (CY_CAPSENSE_WBX_GROUP == snsMethod)
        {
            numEltd = (uint32_t)context->ptrWdConfig[wdIndex].numRows + context->ptrWdConfig[wdIndex].numCols;
            eltdPinCfg = ptrWdCfg->ptrEltdConfig;

            for (eltdIndex = 0u; eltdIndex < numEltd; eltdIndex++)
            {
                /* Loop through all pads for this electrode (ganged sensor) */
                for (i = 0u; i < eltdPinCfg->numPins; i++)
                {
                    padMaskWbx |= (0x01uL << eltdPinCfg->ptrPin[i].padNumber);
                }
                eltdPinCfg++;
            }
        }
    }
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN) */

    /* Change the control switch function depending on the current inactive sensor connection */
    switch (context->ptrBistContext->currentISC)
    {
        case CY_CAPSENSE_BIST_IO_HIGHZA_E:
            cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_HIGH_Z;
            break;

        case CY_CAPSENSE_BIST_IO_VDDA2_E:
            cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_VDDA2;
            break;

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
            case CY_CAPSENSE_BIST_IO_SHIELD_E:
                cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_SHIELD;
                break;
        #endif

        default:
            cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_GND;
            break;
    }

    /* Set the control mux switch registers for inactive pins */
    Cy_CapSense_CalculateMaskRegisters(padMask, cswFuncNum, ptrSensorCfg);

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
        Cy_CapSense_CalculateMaskRegisters(padMaskIsx, cswFuncNum, ptrSensorCfg);
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
        Cy_CapSense_CalculateMaskRegisters(padMaskWbx, cswFuncNum, ptrSensorCfg);
    #endif

    /* Initializes an active sensor (including ganged sensors) by SNS sensor state */
    if (CY_CAPSENSE_BIST_CAP_SHIELD_SCAN == context->ptrBistContext->eltdCapScanMode)
    {
        /* Generate CTRL_MUX masks for the electrode or CSD sensor connection */
        cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_SNS;
        if (CY_CAPSENSE_BIST_IO_SHIELD_E != context->ptrBistContext->currentISC)
        {
            padMask = 0u;
            for (i = 0u; i < context->ptrCommonConfig->csdShieldNumPin; i++)
            {
                padMask |= 0x01uL << context->ptrShieldPinConfig[i].padNumber;
            }
        }
        Cy_CapSense_CalculateMaskRegisters(padMask, cswFuncNum, ptrSensorCfg);
    }
    else
    {
        if ((CY_CAPSENSE_BIST_CAP_ELTD_SCAN == context->ptrBistContext->eltdCapScanMode) ||
            (CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod))
        {
            /* Generate CTRL_MUX masks for the electrode or CSD sensor connection */
            if (CY_CAPSENSE_BIST_CAP_ELTD_SCAN == context->ptrBistContext->eltdCapScanMode)
            {
                ptrEltdCfg = context->ptrBistContext->curPtrEltdCfg;
            }
            else
            {
                ptrEltdCfg = &ptrWdCfg->ptrEltdConfig[slotStcSnsIdx];
            }
            cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_SNS;
            Cy_CapSense_BistGenerateSnsCfgMaskReg(ptrEltdCfg, ptrSensorCfg, cswFuncNum);
        }
        else if (CY_CAPSENSE_CSX_GROUP == ptrWdCfg->senseMethod)
        {
            /* RX ELECTRODE */
            cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_RX;
            ptrEltdCfg = &ptrWdCfg->ptrEltdConfig[(slotStcSnsIdx / ptrWdCfg->numRows)];
            Cy_CapSense_BistGenerateSnsCfgMaskReg(ptrEltdCfg, ptrSensorCfg, cswFuncNum);

            /* TX ELECTRODE */
            cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_TX;
            ptrEltdCfg =  &ptrWdCfg->ptrEltdConfig[ptrWdCfg->numCols + (slotStcSnsIdx % ptrWdCfg->numRows)];
            Cy_CapSense_BistGenerateSnsCfgMaskReg(ptrEltdCfg, ptrSensorCfg, cswFuncNum);
        }
        else
        {
            /* Do nothing */
        }
    }
}
#endif /*((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) || \
         ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN)))*/


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) || (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_ELTD_CAP_EN) || \
     ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN)))
/*******************************************************************************
* Function Name: Cy_CapSense_BistGenerateSnsCfgMaskReg
****************************************************************************//**
*
* Calculates the configuration for all sensor configuration mask registers that
* have to be changed to set the desired CTRL-MUX function
* for the specified electrode for BIST scan.
*
* \param ptrEltdCfg
* The pointer to the specified electrode configuration
* \ref cy_stc_capsense_electrode_config_t structure.
*
* \param ptrSensorCfg
* Specifies the pointer to the sensor configuration to be filled.
*
* \param cswFuncNum
* The desired CTRL-MUX Switch Control Global function.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
*
*******************************************************************************/
static void Cy_CapSense_BistGenerateSnsCfgMaskReg(
                const cy_stc_capsense_electrode_config_t * ptrEltdCfg,
                uint32_t * ptrSensorCfg,
                uint32_t cswFuncNum)
{
    uint32_t padMask = 0u;
    uint32_t i;

    /* Loop through all pads for this electrode (ganged sensor) */
    for (i = 0u; i < ptrEltdCfg->numPins; i++)
    {
        padMask |= 0x01uL << ptrEltdCfg->ptrPin[i].padNumber;
    }
    Cy_CapSense_CalculateMaskRegisters(padMask, cswFuncNum, ptrSensorCfg);
}
#endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) || (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_ELTD_CAP_EN) || \
          ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN))) */


