zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_lp.c
    /*
     * The measurement will be performed with all the sensors disconnected.
     * The code below sets up the configuration of the LO_MASK registers with 0x00uL.
     */
    scanConfigTmp[CY_CAPSENSE_SNS_SW_SEL_CSW_LO_MASK2_INDEX] = 0x00uL;
    scanConfigTmp[CY_CAPSENSE_SNS_SW_SEL_CSW_LO_MASK1_INDEX] = 0x00uL;
    scanConfigTmp[CY_CAPSENSE_SNS_SW_SEL_CSW_LO_MASK0_INDEX] = 0x00uL;

    scanConfigTmp[CY_CAPSENSE_SNS_SCAN_CTL_INDEX] =
            ((((uint32_t)context->ptrBistContext->extCapSubConvNum - 1u) << MSCLP_SNS_SNS_SCAN_CTL_NUM_SUB_CONVS_Pos) |
             MSCLP_SNS_SNS_SCAN_CTL_INIT_BYPASS_Msk);
    scanConfigTmp[CY_CAPSENSE_SNS_CDAC_CTL_INDEX]  =
            ((CY_CAPSENSE_BIST_EXT_CAP_REF_CDAC_DEFAULT << MSCLP_SNS_SNS_CDAC_CTL_SEL_RE_Pos)                         |
             (CY_CAPSENSE_SM_REG_SNS_SNS_CDAC_CTL_FLD_CLOCK_REF_RATE << MSCLP_SNS_SNS_CDAC_CTL_CLOCK_REF_RATE_Pos));
    scanConfigTmp[CY_CAPSENSE_SNS_CTL_INDEX] = MSCLP_SNS_SNS_CTL_SENSE_DIV_Msk;

    /* Initiate the scan in the CPU operating mode. */
    Cy_CapSense_StartCpuScan((const uint32_t *)scanConfigTmp, context);

    /* Calculate a watchdog time in us */
    watchdog = (((CY_CAPSENSE_BIST_EXT_CAP_WDT_FACTOR *
                  (MSCLP_SNS_SNS_CTL_SENSE_DIV_Msk >> MSCLP_SNS_SNS_CTL_SENSE_DIV_Pos)) *
                   (uint32_t)(context->ptrBistContext->extCapSubConvNum)) / CY_CAPSENSE_BIST_EXT_CAP_IMO_CLK_MHZ);

    watchdog = Cy_CapSense_WaitEndOfCpuScan(watchdog, context);

    if (0u != watchdog)
    {
        tempRawcount = ptrHwBase->SNS.RESULT_FIFO_RD;
        /* Check for an overflow or bad conversions */
        if (0u == (tempRawcount & MSCLP_SNS_RESULT_FIFO_RD_OVERFLOW_Msk))
        {
            tempRawcount &= MSCLP_SNS_RESULT_FIFO_RD_RAW_COUNT_Msk;
            bistStatus = CY_CAPSENSE_BIST_SUCCESS_E;
        }
        else
        {
            bistStatus = CY_CAPSENSE_BIST_ERROR_E;
        }
    }

    /* Disable HW IP */
    ptrHwBase->CTL &= (~MSCLP_CTL_ENABLED_Msk);

    /* Check for timeout and if no, then calculate capacitance and store the value to the data structure */
    if (CY_CAPSENSE_BIST_SUCCESS_E == bistStatus)
    {
        /* Store raw counts */
        *ptrExtCapValue = tempRawcount;
    }
    else
    {
        *ptrExtCapValue = 0u;
    }

    return bistStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_BistGenerateBaseCmodConfig
****************************************************************************//**
*
* Changes the configuration for all registers that have to be changed
* one-time to initialize the MSC block for BIST scan.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_BistGenerateBaseCmodConfig(cy_stc_capsense_context_t * context)
{
    MSCLP_Type * ptrHwBase = context->ptrCommonConfig->ptrChConfig->ptrHwBase;
    uint32_t i;

   ptrHwBase->CTL =
            ((CY_CAPSENSE_SM_REG_CTL_FLD_SENSE_EN                               << MSCLP_CTL_SENSE_EN_Pos)              |
             (CY_CAPSENSE_SM_REG_CTL_FLD_MSCCMP_EN                              << MSCLP_CTL_MSCCMP_EN_Pos)             |
             (CY_CAPSENSE_SM_REG_CTL_FLD_OPERATING_MODE                         << MSCLP_CTL_OPERATING_MODE_Pos)        |
             (CY_CAPSENSE_SM_REG_CTL_FLD_BUF_MODE                               << MSCLP_CTL_BUF_MODE_Pos)              |
             (CY_CAPSENSE_SM_REG_CTL_FLD_CLK_MSC_RATIO                          << MSCLP_CTL_CLK_MSC_RATIO_Pos)         |
             (CY_CAPSENSE_SM_REG_CTL_FLD_ENABLED                                << MSCLP_CTL_ENABLED_Pos));
    ptrHwBase->SPARE =                  0x00uL;
    ptrHwBase->SCAN_CTL1 = (CY_CAPSENSE_SM_REG_SCAN_CTL1_FLD_RC_STORE_EN        << MSCLP_SCAN_CTL1_RC_STORE_EN_Pos);
    ptrHwBase->SCAN_CTL2 =
             ((CY_CAPSENSE_BIST_CMOD_VDDA_MEAS_REG_SCAN_CTL2_FLD_CHOP_POL               << MSCLP_SCAN_CTL2_CHOP_POL_Pos)           |
              (CY_CAPSENSE_BIST_CMOD_VDDA_MEAS_REG_SCAN_CTL2_FLD_NUM_EPI_KREF_DELAY     << MSCLP_SCAN_CTL2_NUM_EPI_KREF_DELAY_Pos) |
              (CY_CAPSENSE_BIST_CMOD_VDDA_MEAS_REG_SCAN_CTL2_FLD_NUM_EPI_KREF_DELAY_PRS << MSCLP_SCAN_CTL2_NUM_EPI_KREF_DELAY_PRS_Pos));
    ptrHwBase->INIT_CTL1 =              0x00uL;
    ptrHwBase->INIT_CTL2 =              0x00uL;
    ptrHwBase->INIT_CTL3 =              0x00uL;
    ptrHwBase->INIT_CTL4 =              0x00uL;
    ptrHwBase->SENSE_DUTY_CTL =         0x00uL;
    ptrHwBase->SENSE_PERIOD_CTL =       0x00uL;
    ptrHwBase->FILTER_CTL =             0x00uL;
    ptrHwBase->CCOMP_CDAC_CTL =         0x00uL;
    ptrHwBase->DITHER_CDAC_CTL =        0x00uL;
    ptrHwBase->MSCCMP_CTL =
            ((CY_CAPSENSE_SM_REG_MSCCMP_CTL_FLD_PWR                             << MSCLP_MSCCMP_CTL_PWR_Pos)            |
             (CY_CAPSENSE_SM_REG_MSCCMP_CTL_FLD_FILT                            << MSCLP_MSCCMP_CTL_FILT_Pos));
    ptrHwBase->OBS_CTL =                0x00uL;
    ptrHwBase->AOS_CTL =                0x00uL;
    ptrHwBase->CE_CTL =                 0x00uL;

    /* Check for the system VDDA value and enable PUMP if VDDA is less than the threshold */
    #if (CY_MSCLP_VDDA_PUMP_TRESHOLD > CY_CAPSENSE_VDDA_MV)
        ptrHwBase->PUMP_CTL = MSCLP_PUMP_CTL_PUMP_MODE_Msk;
    #endif

    /* Use 46 MHz IMO frequency with 4 as divider for Cmod measurements */
    ptrHwBase->IMO_CTL =
            ((CY_CAPSENSE_BIST_CMOD_VDDA_MEAS_IMO_CTL_FREQ          << MSCLP_IMO_CTL_FREQ_Pos)                    |
             (CY_CAPSENSE_BIST_CMOD_VDDA_MEAS_IMO_CTL_CLOCK_MSC_DIV << MSCLP_IMO_CTL_CLOCK_MSC_DIV_Pos));

    ptrHwBase->WAKEUP_CMD = 0x00uL;
    ptrHwBase->SW_SEL_GPIO = 0x00uL;
    ptrHwBase->SW_SEL_CDAC_RE =
            ((CY_CAPSENSE_SM_REG_SW_SEL_CDAC_RE_FLD_SW_RETCC << MSCLP_SW_SEL_CDAC_RE_SW_RETCC_Pos)                |
             (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_RE_FLD_SW_RECD  << MSCLP_SW_SEL_CDAC_RE_SW_RECD_Pos)                 |
             (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_RE_FLD_SW_RETV  << MSCLP_SW_SEL_CDAC_RE_SW_RETV_Pos)                 |
             (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_RE_FLD_SW_RETG  << MSCLP_SW_SEL_CDAC_RE_SW_RETG_Pos)                 |
             (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_RE_FLD_SW_REBV  << MSCLP_SW_SEL_CDAC_RE_SW_REBV_Pos)                 |
             (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_RE_FLD_SW_REBG  << MSCLP_SW_SEL_CDAC_RE_SW_REBG_Pos));
    ptrHwBase->SW_SEL_CDAC_CO =         0x00uL;
    ptrHwBase->SW_SEL_CDAC_CF =         0x00uL;
    ptrHwBase->SW_SEL_BGR =             0x00uL;

    /* Clear SW_SEL_CSW registers as not needed for BIST Cmod measurement */
    for (i = 0u; i < CY_MSCLP_SENSE_PAD_NUMBER; i++)
    {
        ptrHwBase->SW_SEL_CSW[i] =      0x00uL;
    }

    /* Clear SW_SEL_CSW_FUNC registers as not needed for BIST Cmod measurement */
    for (i = 0u; i < MSCLP_CSW_GLOBAL_FUNC_NR; i++)
    {
        ptrHwBase->SW_SEL_CSW_FUNC[i] = 0x00uL;
    }

    ptrHwBase->CSW_CTL_LO =             0x00uL;
    ptrHwBase->CSW_CTL_HI =             0x00uL;

