zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_lp.c
    /* Configure MODE[0u] for for BIST Cmod measurement */
    ptrHwBase->MODE[0u].SENSE_DUTY_CTL = 0x00uL;
    ptrHwBase->MODE[0u].SW_SEL_CDAC_FL = 0x00uL;
    ptrHwBase->MODE[0u].SW_SEL_TOP =
           ((CY_CAPSENSE_SM_REG_MODE12_SW_SEL_TOP_FLD_CACC                      << MSCLP_MODE_SW_SEL_TOP_CACC_Pos)                      |
            (CY_CAPSENSE_SM_REG_MODE12_SW_SEL_TOP_FLD_CBCD                      << MSCLP_MODE_SW_SEL_TOP_CBCD_Pos)                      |
            (CY_CAPSENSE_SM_REG_MODE12_SW_SEL_TOP_FLD_AYA_CTL                   << MSCLP_MODE_SW_SEL_TOP_AYA_CTL_Pos)                   |
            (CY_CAPSENSE_SM_REG_MODE12_SW_SEL_TOP_FLD_AYA_EN                    << MSCLP_MODE_SW_SEL_TOP_AYA_EN_Pos)                    |
            (CY_CAPSENSE_SM_REG_MODE12_SW_SEL_TOP_FLD_RMF                       << MSCLP_MODE_SW_SEL_TOP_RMF_Pos));
    ptrHwBase->MODE[0u].SW_SEL_COMP =
            ((CY_CAPSENSE_SM_REG_MODE12_SW_SEL_COMP_FLD_CPMA                    << MSCLP_MODE_SW_SEL_COMP_CPMA_Pos)                     |
             (CY_CAPSENSE_SM_REG_MODE12_SW_SEL_COMP_FLD_CMF                     << MSCLP_MODE_SW_SEL_COMP_CMF_Pos));
    ptrHwBase->MODE[0u].SW_SEL_SH =
            ((CY_CAPSENSE_SM_REG_MODE12_SW_SEL_SH_FLD_CBSO                      << MSCLP_MODE_SW_SEL_SH_CBSO_Pos)                       |
             (CY_CAPSENSE_SM_REG_MODE12_SW_SEL_SH_FLD_FSP                       << MSCLP_MODE_SW_SEL_SH_FSP_Pos)                        |
             (CY_CAPSENSE_SM_REG_MODE12_SW_SEL_SH_FLD_BUF_SEL                   << MSCLP_MODE_SW_SEL_SH_BUF_SEL_Pos)                    |
             (CY_CAPSENSE_SM_REG_MODE12_SW_SEL_SH_FLD_BUF_EN                    << MSCLP_MODE_SW_SEL_SH_BUF_EN_Pos));
    ptrHwBase->MODE[0u].SW_SEL_CMOD1 =   0x00uL;
    ptrHwBase->MODE[0u].SW_SEL_CMOD2 =   0x00uL;
}


/*******************************************************************************
* Function Name: Cy_CapSense_DischargeCmod
****************************************************************************//**
*
* Discharges one of the CAPSENSE Cmod capacitors and restores its previous state.
*
* \param portCmod
* The pointer to the Cmod pin base port register.
*
* \param pinCmod
* The Cmod pin position (bit number) in the port.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_DischargeCmod(
                GPIO_PRT_Type * portCmod,
                uint32_t pinCmod,
                cy_stc_capsense_context_t * context)
{
    en_hsiom_sel_t hsiomReg;
    uint32_t pcReg;
    uint32_t  interruptState;

    /* Disconnect Ext Cap from AMUXBUS-A / AMUXBUSB using HSIOM registers */
    interruptState = Cy_SysLib_EnterCriticalSection();
    hsiomReg = Cy_GPIO_GetHSIOM(portCmod, pinCmod);
    Cy_GPIO_SetHSIOM(portCmod, pinCmod, CY_CAPSENSE_HSIOM_SEL_GPIO);
    Cy_SysLib_ExitCriticalSection(interruptState);

    /* Set port configuration register (drive mode) to STRONG mode */
    interruptState = Cy_SysLib_EnterCriticalSection();
    pcReg = Cy_GPIO_GetDrivemode(portCmod, pinCmod);
    Cy_GPIO_Clr(portCmod, pinCmod);
    Cy_GPIO_SetDrivemode(portCmod, pinCmod, CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF);
    Cy_SysLib_ExitCriticalSection(interruptState);

    /* Now external CSD-related capacitors discharging */
    Cy_SysLib_DelayUs(context->ptrBistContext->extCapDischargeTime);

    /* Restore Ext Cap settings */
    interruptState = Cy_SysLib_EnterCriticalSection();
    Cy_GPIO_SetDrivemode(portCmod, pinCmod, pcReg);
    Cy_GPIO_SetHSIOM(portCmod, pinCmod, hsiomReg);
    Cy_SysLib_ExitCriticalSection(interruptState);
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_EXTERNAL_CAP_EN) || (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_VDDA_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_EXTERNAL_CAP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_MeasureCapacitanceCap_V3Lp
****************************************************************************//**
*
* The internal function for the external capacitance measurements
* on the fifth-generation low power CAPSENSE&trade; devices. For details, see
* the Cy_CapSense_MeasureCapacitanceCap() description.
*
* \note
* This function is available only for the fifth-generation low power
* CAPSENSE&trade;.
*
* \param integrationCapId
* Indexes of external capacitors to measure their capacitance.
* There are macros for each of them, namely:
* * CY_CAPSENSE_BIST_CMOD01_ID_E for the MSC0 Cmod1 capacitor
* * CY_CAPSENSE_BIST_CMOD02_ID_E for the MSC0 Cmod2 capacitor
*
* \param ptrValue
* The pointer to the result of the measurement. The result is calculated as
* a specified capacitor capacitance value in picofarads. The user
* declares a variable of the uint32_t type and passes the pointer to this
* variable as the function parameter. If the ptrValue parameter is NULL then
* the capacitance value is not returned through the parameter but stored to the
* corresponding field of the \ref cy_stc_capsense_bist_context_t structure.
*
* \param maxCapacitance
* An expected by the user maximum value of the measured capacitance in
* nanofarads in the range from 1 to 25 nF.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status of the test execution:
* - CY_CAPSENSE_BIST_SUCCESS_E          - The measurement completes
*                                         successfully, the result is valid.
* - CY_CAPSENSE_BIST_BAD_PARAM_E        - The input parameter is invalid.
*                                         The measurement was not executed.
* - CY_CAPSENSE_BIST_HW_BUSY_E          - The CAPSENSE&trade; HW block is busy with
*                                         a previous operation. The measurement
*                                         was not executed.
* - CY_CAPSENSE_BIST_TIMEOUT_E          - The timeout was reached during
*                                         the measurement.
*                                         The measurement result is zeroed.
*                                         The capacitor might be shorted to
*                                         GND.
* - CY_CAPSENSE_BIST_ERROR_E            - An unexpected fault occurred during
*                                         the measurement.
*
*******************************************************************************/
cy_en_capsense_bist_status_t Cy_CapSense_MeasureCapacitanceCap_V3Lp(
                cy_en_capsense_bist_external_cap_id_t integrationCapId,
                uint32_t * ptrValue,
                uint32_t maxCapacitance,
                cy_stc_capsense_context_t * context)
{
    uint32_t rawCounts = 0u;
    GPIO_PRT_Type * portCmod;
    uint32_t pinCmod;
    uint16_t * ptrResult = NULL;
    uint32_t nSub;
    uint32_t maxRaw;
    uint32_t cdacTrim;
    cy_en_capsense_bist_status_t bistStatus = CY_CAPSENSE_BIST_SUCCESS_E;

    if ((NULL == context) || (CY_CAPSENSE_BIST_EXT_CAP_MAX_CAP < maxCapacitance) || (0u == maxCapacitance) ||
        (CY_CAPSENSE_BIST_CMOD02_ID_E < integrationCapId))
    {
        bistStatus = CY_CAPSENSE_BIST_BAD_PARAM_E;
    }

    if (CY_CAPSENSE_BIST_SUCCESS_E == bistStatus)
    {
        if (CY_CAPSENSE_NOT_BUSY == Cy_CapSense_IsBusy(context))
        {
            /* Set the BUSY status and switch the HW resource configuration to the BIST mode */
            context->ptrCommonContext->status = CY_CAPSENSE_BUSY | CY_CAPSENSE_MW_STATE_BIST_MASK;
            switch (integrationCapId)
            {
                case CY_CAPSENSE_BIST_CMOD01_ID_E:
                    portCmod = context->ptrCommonConfig->ptrChConfig->portCmod1;
                    pinCmod = (uint32_t)context->ptrCommonConfig->ptrChConfig->pinCmod1;
                    ptrResult = &context->ptrBistContext->cMod01Cap;
                    break;
                case CY_CAPSENSE_BIST_CMOD02_ID_E:
                    portCmod = context->ptrCommonConfig->ptrChConfig->portCmod2;
                    pinCmod = (uint32_t)context->ptrCommonConfig->ptrChConfig->pinCmod2;
                    ptrResult = &context->ptrBistContext->cMod02Cap;
                    break;
                default:
                    bistStatus = CY_CAPSENSE_BIST_BAD_PARAM_E;
                    break;
            }
            if (CY_CAPSENSE_STATUS_SUCCESS !=
                Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_BIST_FUNCTIONALITY, context))
            {
                bistStatus = CY_CAPSENSE_BIST_ERROR_E;
            }

            if (CY_CAPSENSE_BIST_SUCCESS_E == bistStatus)
            {
                /* Generate the MSC base configuration for BIST scan and send it to the MSC HW block */
                Cy_CapSense_BistSwitchHwConfig(CY_CAPSENSE_BIST_HW_EXTERNAL_CAP_E, CY_CAPSENSE_UNDEFINED_GROUP, 0u, context);

                /* Discharge the specified capacitor */
                context->ptrBistContext->extCapDischargeTime = (uint16_t)((CY_CAPSENSE_BIST_EXT_CAP_DISCHARGE_FACTOR *
                    maxCapacitance * CY_CAPSENSE_BIST_EXT_CAP_SERIAL_RESISTANCE) / CY_CAPSENSE_CONVERSION_KILO);

                if (0u == context->ptrBistContext->extCapDischargeTime)
                {
                    context->ptrBistContext->extCapDischargeTime = 1u;
                }

                Cy_CapSense_DischargeCmod(portCmod, pinCmod, context);

                /* Calculate the needed max raw counts value */
                maxRaw = ((((CY_CAPSENSE_BIST_EXT_CAP_ACCURACY_FACTOR * maxCapacitance) *
                            CY_CAPSENSE_CONVERSION_KILO) / CY_CAPSENSE_BIST_EXT_CAP_REF_CDAC_DEFAULT) *
                          CY_CAPSENSE_CONVERSION_KILO) / CY_CAPSENSE_BIST_CAP_MEAS_CDAC_LSB_FF_DIV_1000;

                /* Calculate a corresponding number of sub-conversions for the measurement */
                nSub = maxRaw / (((uint32_t)MSCLP_SNS_SNS_CTL_SENSE_DIV_Msk >> MSCLP_SNS_SNS_CTL_SENSE_DIV_Pos) + 1u);

                if (CY_CAPSENSE_14_BIT_MASK < nSub)
                {
                    nSub = CY_CAPSENSE_14_BIT_MASK;
                }
                if (0u == nSub)
                {
                    nSub = 1u;
                }

                /* Number of sub-conversions variable initialization in BIST data structure */
                context->ptrBistContext->extCapSubConvNum = (uint16_t)nSub;

                /* Connect Cmod to AMuxBusA */
                Cy_CapSense_SsConfigPinRegisters(portCmod, pinCmod,
                                                 CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_AMUXA,
                                                 CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_DIS);

                /* Perform the measurement */
                bistStatus = Cy_CapSense_BistMeasureCapacitanceCapRun(&rawCounts, context);

                /* Disconnect Cmod from AMuxBusA */
                Cy_CapSense_SsConfigPinRegisters(portCmod, pinCmod,
                                                 CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_GPIO,
                                                 CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_DIS);

                if (CY_CAPSENSE_BIST_SUCCESS_E == bistStatus)
                {
                    /* Calculates the capacitance value in pF */
                    rawCounts *= CY_CAPSENSE_BIST_EXT_CAP_RESULT_FACTOR;
                    rawCounts += CY_CAPSENSE_BIST_EXT_CAP_RESULT_DIVIDER / 2u;
                    rawCounts /= CY_CAPSENSE_BIST_EXT_CAP_RESULT_DIVIDER;

                    /* Adds CDAC trimming */
                    if (0u != context->ptrCommonContext->cdacTrimCoefficient)
                    {
                        cdacTrim = context->ptrCommonContext->cdacTrimCoefficient;

                        if (0u != cdacTrim)
                        {
                            /* Scales result */
                            rawCounts = (uint32_t)(rawCounts << CY_CAPSENSE_CDAC_TRIM_OFFSET);
                            /* Rounding to the nearest */
                            rawCounts += (cdacTrim >> 0x1u);
                            rawCounts /= cdacTrim;
                        }
                    }

                    if (CY_CAPSENSE_16_BIT_MASK < rawCounts)
                    {
                        rawCounts = CY_CAPSENSE_16_BIT_MASK;
                    }

                    *ptrResult = (uint16_t)rawCounts;

                    if (NULL != ptrValue)
                    {
                        *ptrValue = *ptrResult;
                    }
                }
                else
                {
                    *ptrResult = 0u;
                    if (NULL != ptrValue)
                    {
                        *ptrValue = 0u;
                    }
                }
            }

            /* Clear the BUSY flag */
            context->ptrCommonContext->status = CY_CAPSENSE_NOT_BUSY;
        }
        else
        {
            bistStatus = CY_CAPSENSE_BIST_HW_BUSY_E;
        }
    }

    return bistStatus;
}


