zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_lp.c
/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureCapacitanceCapAll
****************************************************************************//**
*
* This internal function measures capacitance of all external capacitors.
*
* The function measures capacitances of all external capacitors Cmod1 and Cmod2.
* The function stores cap values in the corresponding registers.
* The function is called by the Cy_CapSense_RunSelfTest() function.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status of the test execution:
* - CY_CAPSENSE_BIST_SUCCESS_E - The measurement completes
*                                successfully, the result is valid.
* - CY_CAPSENSE_BIST_HW_BUSY_E - The CAPSENSE&trade; HW block is busy with a previous
*                                operation.
* - CY_CAPSENSE_BIST_ERROR_E - An unexpected fault occurred during
*                            the measurement, you may need to repeat the measurement.
*
*******************************************************************************/
static cy_en_capsense_bist_status_t Cy_CapSense_BistMeasureCapacitanceCapAll(
                cy_stc_capsense_context_t * context)
{
    uint32_t capCapacitance = 0u;
    cy_en_capsense_bist_status_t tempStatus;
    cy_en_capsense_bist_status_t bistStatus = CY_CAPSENSE_BIST_SUCCESS_E;

    tempStatus = Cy_CapSense_MeasureCapacitanceCap_V3Lp(CY_CAPSENSE_BIST_CMOD01_ID_E, &capCapacitance,
                                                        CY_CAPSENSE_BIST_EXT_CAP_CMOD_MAX_VALUE, context);
    if (CY_CAPSENSE_BIST_SUCCESS_E != tempStatus)
    {
        bistStatus = tempStatus;
    }

    tempStatus = Cy_CapSense_MeasureCapacitanceCap_V3Lp(CY_CAPSENSE_BIST_CMOD02_ID_E, &capCapacitance,
                                                        CY_CAPSENSE_BIST_EXT_CAP_CMOD_MAX_VALUE, context);
    if (CY_CAPSENSE_BIST_SUCCESS_E != tempStatus)
    {
        bistStatus = tempStatus;
    }

    return bistStatus;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_EXTERNAL_CAP_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_VDDA_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_MeasureVdda_V3Lp
****************************************************************************//**
*
* Measures a VDDA voltage, returns the measured voltage in
* millivolts through the ptrValue argument and stores it to the .vddaVoltage
* field of the \ref cy_stc_capsense_bist_context_t structure.
*
* This function measures the device analog supply voltage (VDDA) without need
* of explicitly connecting VDDA to any additional GPIO input.
* This capability can be used in various cases, for example to monitor
* the battery voltage.
*
* The function uses Cmod1 charging/discharging due to the measurement.
* As the charging is non-linear, the measurement accuracy is about 20%.
*
* A measurement can be done only if the CAPSENSE&trade; middleware is in the
* IDLE state. This function must not be called while the CAPSENSE&trade;
* middleware is busy. The function is blocking, i.e. waits for the conversion
* to be completed prior to returning to the caller.
*
* \note
* This function is available for the forth-generation and the fifth-generation
* low power CAPSENSE&trade;.
*
* \param ptrValue
* The pointer to the uint32_t to store measured VDDA voltage value.
* If the ptrValue parameter is NULL then VDDA voltage value will not be returned
* through the parameter but still it will be stored in the .vddaVoltage
* field of the \ref cy_stc_capsense_bist_context_t structure. If the status
* of the test execution is not CY_CAPSENSE_BIST_SUCCESS_E the value
* the ptrValue parameter is pointed to will be zeroed.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status of the test execution:
* - CY_CAPSENSE_BIST_SUCCESS_E          - The measurement executed
*                                         successfully.
* - CY_CAPSENSE_BIST_BAD_PARAM_E        - The input parameter is invalid.
*                                         The measurement was not executed.
* - CY_CAPSENSE_BIST_ERROR_E            - An unexpected fault occurred during
*                                         the measurement.
*
*******************************************************************************/
cy_en_capsense_bist_status_t Cy_CapSense_MeasureVdda_V3Lp(
                uint32_t * ptrValue,
                cy_stc_capsense_context_t * context)
{
    cy_en_capsense_bist_status_t bistStatus = CY_CAPSENSE_BIST_BAD_PARAM_E;

    if (NULL != context)
    {
        if (CY_CAPSENSE_NOT_BUSY == Cy_CapSense_IsBusy(context))
        {
            /* Set the BUSY status and switch the HW resource configuration to the BIST mode */
            context->ptrCommonContext->status = CY_CAPSENSE_BUSY | CY_CAPSENSE_MW_STATE_BIST_MASK;
            if (CY_CAPSENSE_STATUS_SUCCESS != Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_BIST_FUNCTIONALITY, context))
            {
                bistStatus = CY_CAPSENSE_BIST_ERROR_E;
            }
            else
            {
                bistStatus = CY_CAPSENSE_BIST_SUCCESS_E;
            }
            if (CY_CAPSENSE_BIST_SUCCESS_E == bistStatus)
            {
                Cy_CapSense_BistSwitchHwConfig(CY_CAPSENSE_BIST_HW_VDDA_E, CY_CAPSENSE_UNDEFINED_GROUP, 0u, context);

                /* Perform two-phase VDDA measurement */
                bistStatus = Cy_CapSense_BistMeasureVddaRun(context);

                if (CY_CAPSENSE_BIST_SUCCESS_E == bistStatus)
                {
                    if (NULL != ptrValue)
                    {
                        *ptrValue = context->ptrBistContext->vddaVoltage;
                    }
                }
                else
                {
                    if (NULL != ptrValue)
                    {
                        *ptrValue = 0u;
                    }
                }
            }
            /* Clear the BUSY flag */
            context->ptrCommonContext->status = CY_CAPSENSE_NOT_BUSY;
        }
        else
        {
            bistStatus = CY_CAPSENSE_BIST_HW_BUSY_E;
        }
    }

    return bistStatus;
}


