zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_lp.c
/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureVddaRun
****************************************************************************//**
*
* The internal function performs the two phase voltage measurement
* by converting the internal band gap reference Vbgref and Vdda/2 voltages
* to the raw counts and calculating the last one in millivolts.
*
* The function performs the following tasks:
* * Measures the time to bring Cmod1 up from Vssa to Vbgref
* * Measures the time to bring Cmod1 up from Vssa to Vdda/2
* * Calculates the results of measurements in millivolts.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status of the test execution:
* - CY_CAPSENSE_BIST_SUCCESS_E - The measurement completes
*                                successfully, the result is valid.
* - CY_CAPSENSE_BIST_ERROR_E   - An unexpected fault occurred during
*                                the measurement, you may need to repeat
*                                the measurement.
*
*******************************************************************************/
static cy_en_capsense_bist_status_t Cy_CapSense_BistMeasureVddaRun(
                cy_stc_capsense_context_t * context)
{
    uint32_t rawVref = 0u;
    uint32_t rawVdda2 = 0u;
    uint32_t vddaValue = 0u;
    MSCLP_Type * ptrHwBase = context->ptrCommonConfig->ptrChConfig->ptrHwBase;
    GPIO_PRT_Type * portCmod = context->ptrCommonConfig->ptrChConfig->portCmod1;
    uint32_t pinCmod = (uint32_t)context->ptrCommonConfig->ptrChConfig->pinCmod1;

    cy_en_capsense_bist_status_t bistStatus = CY_CAPSENSE_BIST_BAD_PARAM_E;

    /*
     * Phase 1:
     * Measures raw counts for Cmod1 charge from VSSA to BGVREF.
     * The .extCapSubConvNum is initialized to the sense clock period number
     * for Cmod measurement
     * of the CY_CAPSENSE_BIST_VDDA_MEAS_CMOD1_MAX_POSSIBLE_VALUE
     */
    context->ptrBistContext->extCapSubConvNum = (uint16_t)CY_CAPSENSE_BIST_VDDA_MEAS_NUM_SNS_CLK;

    /* Connect the Plus comparator terminal to the AmuxBusA and the Minus comparator terminal to the BandGapVref */
    ptrHwBase->MODE[0u].SW_SEL_COMP =
            (CY_CAPSENSE_SM_REG_MODE12_SW_SEL_COMP_FLD_CPMA                     << MSCLP_MODE_SW_SEL_COMP_CPMA_Pos);
    ptrHwBase->SW_SEL_BGR = (CY_CAPSENSE_BIST_CMOD_MEAS_SW_SEL_BGR_FLD_SW_BGRCM << MSCLP_SW_SEL_BGR_SW_BGRCM_Pos);

    /* Discharge the Cmod1 capacitor */
    context->ptrBistContext->extCapDischargeTime = (uint16_t)(CY_CAPSENSE_BIST_VDDA_MEAS_CMOD1_DISCHARGE_TIME);
    if (0u == context->ptrBistContext->extCapDischargeTime)
    {
        context->ptrBistContext->extCapDischargeTime = 1u;
    }
    Cy_CapSense_DischargeCmod(portCmod, pinCmod, context);

    /* Connect Cmod to AMuxBusA */
    Cy_CapSense_SsConfigPinRegisters(portCmod, pinCmod,
                                     CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_AMUXA,
                                     CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_DIS);

    /* Perform the measurement */
    bistStatus = Cy_CapSense_BistMeasureCapacitanceCapRun(&rawVref, context);

    /* Disconnect Cmod from AMuxBusA */
    Cy_CapSense_SsConfigPinRegisters(portCmod, pinCmod,
                                     CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_GPIO,
                                     CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_DIS);

    if (CY_CAPSENSE_BIST_SUCCESS_E == bistStatus)
    {
        /*
         * Phase 2:
         * Measures raw counts for Cmod1 charge from VSSA to VDDA/2
         */

        /* Connect the Vdda/2 to the Minus comparator terminal */
        ptrHwBase->SW_SEL_BGR = 0u;
        ptrHwBase->MODE[0u].SW_SEL_COMP =
                ((CY_CAPSENSE_SM_REG_MODE12_SW_SEL_COMP_FLD_CPMA << MSCLP_MODE_SW_SEL_COMP_CPMA_Pos)   |
                 (CY_CAPSENSE_SM_REG_MODE12_SW_SEL_COMP_FLD_CMF << MSCLP_MODE_SW_SEL_COMP_CMF_Pos));

        /* Discharge Cmod1 to Vssa (GND) */
        Cy_CapSense_DischargeCmod(portCmod, pinCmod, context);

        /* Connect Cmod to AMuxBusA */
        Cy_CapSense_SsConfigPinRegisters(portCmod, pinCmod,
                                         CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_AMUXA,
                                         CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_DIS);

        /* Perform the measurement */
        bistStatus = Cy_CapSense_BistMeasureCapacitanceCapRun(&rawVdda2, context);

        /* Disconnect Cmod from AMuxBusA */
        Cy_CapSense_SsConfigPinRegisters(portCmod, pinCmod,
                                         CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_GPIO,
                                         CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_DIS);
        if (CY_CAPSENSE_BIST_SUCCESS_E == bistStatus)
        {
        /*
         * Phase 3:
         * Convert the results of measurements to millivolts taking into consideration that in Phase 2
         * Vdda/2 was measured.
         */
         vddaValue = ((CY_CAPSENSE_BIST_VDDA_MEAS_RESULT_FACTOR * rawVdda2) / rawVref) +
                     CY_CAPSENSE_BIST_VDDA_MEAS_RESULT_SHIFT;

            /* Store the measured value */
            context->ptrBistContext->vddaVoltage = (uint16_t)vddaValue;
        }
        else
        {
            context->ptrBistContext->vddaVoltage = 0u;
        }
    }

    return bistStatus;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_VDDA_EN) */


/*******************************************************************************
* Function Name: Cy_CapSense_BistInitialize
****************************************************************************//**
*
* The internal function initializes some critical parameters
* for Built-in Self-test (BIST) mode.
*
* This function prepares the resource capturing to execute the BIST functions.
* The HW resource configuring is performed by the Cy_CapSense_BistSwitchHwConfig()
* function depending on a the type of the test to be executed.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_BistInitialize(cy_stc_capsense_context_t * context)
{
    /*
     * This function prepares the BIST HW and pins re-configuring by setting some
     * critical internal parameters to undefined states.
     * Use this function after switching from CSD or CSX sensing modes.
     */
    context->ptrBistContext->hwConfig = CY_CAPSENSE_BIST_HW_UNDEFINED_E;
    context->ptrBistContext->currentISC = CY_CAPSENSE_BIST_IO_UNDEFINED_E;
    context->ptrBistContext->eltdCapSenseGroup = CY_CAPSENSE_UNDEFINED_GROUP;
}


