zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_lp.c
/*******************************************************************************
* Function Name: Cy_CapSense_BistDsInitialize_V3Lp
****************************************************************************//**
*
* This internal function initializes the BIST cy_stc_capsense_bist_context_t
* data structure parameters to be used in the test execution.
*
* The function is called once at the CAPSENSE&trade; start and performs
* the \ref cy_stc_capsense_bist_context_t structure initialization based
* on the configured parameters.
*
* Some of the parameters of the \ref cy_stc_capsense_bist_context_t structure
* can be changed in the run-time, but some changes require repeating the call
* of this function to the re-calculate register values.
* Refer to description of the following functions which parameters are used
* as an input and which are outputs:
* * Cy_CapSense_BistMeasureCapacitanceSensorInit()
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_BistDsInitialize_V3Lp(cy_stc_capsense_context_t * context)
{
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN)
        uint32_t wdIndex;
        uint32_t wdNum = (uint32_t)context->ptrCommonConfig->numWd;

        /* Initialize CRC for all widgets */
        for (wdIndex = 0u; wdIndex < wdNum; wdIndex++)
        {
            Cy_CapSense_UpdateCrcWidget(wdIndex, context);
        }
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN)) */

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN)
        Cy_CapSense_BistMeasureCapacitanceSensorInit(context);
    #endif

    context->ptrBistContext->hwConfig = CY_CAPSENSE_BIST_HW_UNDEFINED_E;
    context->ptrBistContext->currentISC = CY_CAPSENSE_BIST_IO_UNDEFINED_E;
    context->ptrBistContext->eltdCapSenseGroup = CY_CAPSENSE_UNDEFINED_GROUP;
    context->ptrBistContext->intrEltdCapCsdISC = context->ptrBistContext->eltdCapCsdISC;
    context->ptrBistContext->intrEltdCapCsxISC = context->ptrBistContext->eltdCapCsxISC;
    context->ptrBistContext->intrEltdCapShieldISC = context->ptrBistContext->shieldCapISC;
}


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_HW_GROUP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_BistDisableMode
****************************************************************************//**
*
* This internal function releases HW resources and pins captured by BIST
* to be used by other CAPSENSE&trade; modes.
*
* This function releases the shared HW resources like connection
* to the analog bus in the AMUX mode.
* The function does not configure HW block registers to the default state.
* It is used by the Cy_CapSense_SwitchHwConfiguration() function only at switching
* to another sensing mode.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_BistDisableMode(cy_stc_capsense_context_t * context)
{
    Cy_CapSense_BistSwitchAllSnsPinState(CY_CAPSENSE_BIST_IO_STRONG_E, context);
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
        Cy_CapSense_BistSwitchAllShieldPinState(CY_CAPSENSE_BIST_IO_STRONG_E, context);
    #endif
    Cy_CapSense_BistSwitchAllExternalCapPinState(CY_CAPSENSE_BIST_IO_STRONG_E, context);

    context->ptrBistContext->hwConfig = CY_CAPSENSE_BIST_HW_UNDEFINED_E;
    context->ptrBistContext->currentISC = CY_CAPSENSE_BIST_IO_UNDEFINED_E;
}

/*******************************************************************************
* Function Name: Cy_CapSense_BistSwitchHwConfig
****************************************************************************//**
*
* This internal function switches the MSCv3 HW block configuration for
* BIST operations.
*
* The function checks the current MSCv3 HW block configuration.
* If it differs from a desired configuration, the function disables the current
* configuration and sets the desired one.
*
* \param hwCfg
* Specifies the desired configuration.
*
* \param bistSenseGroup
* Specifies the sense group to be scanned during the sensor or electrode
* capacitance measurement scan.
* The parameter does not matter for short tests.
*
* \param bistScanMode
* Specifies the scanning mode (by electrodes or by slots) during the sensor
* or electrode capacitance measurement scan.
* The parameter does not matter for short tests.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_BistSwitchHwConfig(
                cy_en_capsense_bist_hw_config_t hwCfg,
                uint8_t bistSenseGroup,
                uint8_t bistScanMode,
                cy_stc_capsense_context_t * context)
{
    if ((context->ptrBistContext->hwConfig != hwCfg) ||
        (context->ptrBistContext->eltdCapSenseGroup != bistSenseGroup) ||
        (context->ptrBistContext->eltdCapScanMode != bistScanMode))
    {
        context->ptrBistContext->hwConfig = hwCfg;
        context->ptrBistContext->eltdCapSenseGroup = bistSenseGroup;
        context->ptrBistContext->eltdCapScanMode = bistScanMode;
        /* Enable the specified mode */
        switch (hwCfg)
        {
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_SHORT_EN)
                case CY_CAPSENSE_BIST_HW_SHORT_E:
                {
                    break;
                }
            #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_SHORT_EN) */

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN)

                #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) || (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_ELTD_CAP_EN) || \
                    ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN)))
                    case CY_CAPSENSE_BIST_HW_ELTD_CAP_E:
                    {
                        Cy_CapSense_BistGenerateBaseConfig(context);

                        Cy_CapSense_SetIOsInDesiredState(CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_GPIO, 0u,
                                                         CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_EN, context);

