zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_lp.c
                        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
                            Cy_CapSense_SetShieldPinsInDesiredState(CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_GPIO,
                                                                    CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_EN, context);
                        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) */

                        Cy_CapSense_SetCmodInDesiredState(CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_GPIO,
                                                          CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_EN, context);
                        break;
                    }
                #endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) || (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_ELTD_CAP_EN) || \
                           ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN))) */

                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_EXTERNAL_CAP_EN)
                    case CY_CAPSENSE_BIST_HW_EXTERNAL_CAP_E:
                    {
                        Cy_CapSense_SetIOsInDesiredState(CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF,
                                                         CY_CAPSENSE_HSIOM_SEL_GPIO, 0u,
                                                         CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_DIS, context);

                        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
                            Cy_CapSense_SetShieldPinsInDesiredState(CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF,
                                                                    CY_CAPSENSE_HSIOM_SEL_GPIO,
                                                                    CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_DIS, context);
                        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) */

                        context->ptrActiveScanSns->currentSenseMethod = CY_CAPSENSE_UNDEFINED_GROUP;
                        Cy_CapSense_SetCmodInDesiredState(CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF, CY_CAPSENSE_HSIOM_SEL_GPIO,
                                                          CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_DIS, context);
                        Cy_CapSense_BistGenerateBaseCmodConfig(context);
                        Cy_CapSense_SetupCpuOperatingMode(context);
                        break;
                    }
                #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_EXTERNAL_CAP_EN) */

            #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN) */

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_VDDA_EN)
                case CY_CAPSENSE_BIST_HW_VDDA_E:
                {
                    Cy_CapSense_SetIOsInDesiredState(CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_GPIO, 0u,
                                                     CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_DIS, context);

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
                        Cy_CapSense_SetShieldPinsInDesiredState(CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_GPIO,
                                                                CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_DIS, context);
                    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) */

                    context->ptrActiveScanSns->currentSenseMethod = CY_CAPSENSE_UNDEFINED_GROUP;
                    Cy_CapSense_SetCmodInDesiredState(CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_GPIO,
                                                      CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_DIS, context);

                    Cy_CapSense_BistGenerateBaseCmodConfig(context);
                    Cy_CapSense_SetupCpuOperatingMode(context);
                    break;
                }
            #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_VDDA_EN) */

            default:
            {
                /* Nothing to do */
                break;
            }
        }
    }
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_HW_GROUP_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureCapacitanceSensorInit
****************************************************************************//**
*
* This internal function calculates the parameters for sensor, shield or
* electrode capacitance measurements.
*
* It is called by Cy_CapSense_BistDsInitialize() once at the CAPSENSE&trade; MW start.
*
* The following parameters of cy_stc_capsense_bist_context_t are used as
* an input for the calculation:
* * .eltdCapModClk
* * .eltdCapSnsClk
*
* The function checks for parameter limitations and corrects the values before
* the calculation if they exceed.
*
* The following parameters of cy_stc_capsense_bist_context_t are updated
* by the calculation:
* * .eltdCapModClk
* * .eltdCapSnsClk
* * .eltdCapSubConvNum
*
* Restarting CAPSENSE&trade; MW or calling of the Cy_CapSense_BistDsInitialize()
* function overwrites the output parameters.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_BistMeasureCapacitanceSensorInit(
                cy_stc_capsense_context_t * context)
{
    cy_stc_capsense_bist_context_t * ptrBistCxt = context->ptrBistContext;

    /* ModClk */
    if (0u == ptrBistCxt->eltdCapModClk)
    {
        ptrBistCxt->eltdCapModClk = (uint16_t)CY_CAPSENSE_BIST_ELTD_CAP_MODCLK_DIV_DEFAULT;
    }

    /* SnsClk */
    if (0u == ptrBistCxt->eltdCapSnsClk)
    {
        ptrBistCxt->eltdCapSnsClk = (uint16_t)CY_CAPSENSE_BIST_ELTD_CAP_SNSCLK_DIV_DEFAULT;
    }
    /* Check the snsClk divider value */
    if (CY_CAPSENSE_BIST_SNS_CLK_MIN_DIVIDER > ptrBistCxt->eltdCapSnsClk)
    {
        ptrBistCxt->eltdCapSnsClk = CY_CAPSENSE_BIST_SNS_CLK_MIN_DIVIDER;
    }
    if (CY_CAPSENSE_BIST_SNS_CLK_MAX_DIVIDER < ptrBistCxt->eltdCapSnsClk)
    {
        ptrBistCxt->eltdCapSnsClk = CY_CAPSENSE_BIST_SNS_CLK_MAX_DIVIDER;
    }
    /* NumSubConv */
    ptrBistCxt->eltdCapSubConvNum = (uint16_t)CY_CAPSENSE_BIST_ELTD_CAP_SUBCONV_NUM_DEFAULT;
    ptrBistCxt->eltdCapNumEpiCycles = CY_CAPSENSE_BIST_ELTD_CAP_NUM_EPI_CYCLES;
    ptrBistCxt->eltdCapNumFineInitWaitCycles = ptrBistCxt->eltdCapNumEpiCycles;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN) */


